{
  "Memorial Gymnasium": [
    {
      "title": "Facility Operations Assistant – Outdoor Support (Student Wage)",
      "conciseDescription": "University of Virginia Department of Recreation We offer a variety of programs, services and spaces where our students, faculty and staff feel welcome and safe, can find meaningful connections and develop all dimensions of wellness (social, intellectual, physical, emotional, spiritual, financial and occupational) that enrich the learning, living, teaching and working experiences at UVA Facility Operations Assistant – Outdoor Support Team Members Responsibility: Take Pride in being a Student Employee in the University of Virginia Department of Recreation (UVA Rec). Establish a service focused rapport and relationship with Student and Departmental Staff, Members and Guest of the Facility. Promote Exceptional Customer Service to create a positive environment for members and guests.",
      "timePosted": "2025-03-28",
      "wage": "$12.50",
      "requirements": "Not specified.",
      "responsibilities": "University of Virginia Department of Recreation We offer a variety of programs, services and spaces where our students, faculty and staff feel welcome and safe, can find meaningful connections and develop all dimensions of wellness (social, intellectual, physical, emotional, spiritual, financial and occupational) that enrich the learning, living, teaching and working experiences at UVA Facility Operations Assistant – Outdoor Support Team Members Responsibility: Take Pride in being a Student Employee in the University of Virginia Department of Recreation (UVA Rec)",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Tennis Instructor (Student Wage)",
      "conciseDescription": "The University of Virginia Intramural-Recreational Sports Department is looking for Tennis Instructors to work for our Tennis Instructional Program this spring. Lessons are held at Snyder Tennis Center on UVA’s Grounds. Instructors will be leading up to six participants during lessons.",
      "timePosted": "2024-11-01",
      "wage": "$15.00 - $20.00",
      "requirements": "Must have excellent communication skills, ability to modify movements for participant safety, and exemplary customer service skills",
      "responsibilities": "Assist in the execution of Emergency Action Procedures",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Pickleball Instructor (Student Wage)",
      "conciseDescription": "The University of Virginia Intramural-Recreational Sports Department is looking for Pickleball Instructors to work for our Pickleball Instructional Program this spring. Lessons are held at Snyder Tennis Center on UVA’s Grounds. Instructors will be leading up to six participants during lessons.",
      "timePosted": "2023-11-14",
      "wage": "$15.00 - $20.00",
      "requirements": "Must have excellent communication skills, ability to modify movements for participant safety, and exemplary customer service skills",
      "responsibilities": "Assist in the execution of Emergency Action Procedures",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Bond House": [
    {
      "title": "Karsh Institute of Democracy Research Assistant - Hybrid Position (Student Wage)",
      "conciseDescription": "The University of Virginia’s Karsh Institute of Democracy is seeking a Research Assistant to support a mixed-methods study of the Karsh Institute’s Student Dialogue Fellowship (Fellowship), a program that seeks to address the challenge of political polarization by fostering engaged dialogue amongst ideologically diverse college students. The Fellowship equips participants with the competencies and character necessary for constructive conversations and meaningful engagement in public life by cultivating civic and intellectual virtues such as curiosity, intellectual humility, and open-mindedness. Led by UVA Professor Rachel Wahl, the research component of the Fellowship will include a qualitative longitudinal study to evaluate how dialogue interventions contribute to students’ personal and civic development.",
      "timePosted": "2025-03-26",
      "wage": "$20",
      "requirements": "Key Responsibilities Assist with the collection of qualitative and quantitative data Assist with the analysis of qualitative and quantitative data Assist with the administration of research, including overseeing, organizing, and recording times and dates for interviews, surveys, and related meetings Assist with other research tasks as assigned, such as the submission of IRB protocols and communications with research subjects Anticipated Assignment Dates: August 2025 – May 2026 Position Type: Part-time, hourly wage, approximately 10-20 hours per week Desired Class Level(s): Rising fourth-year undergraduates or graduate students Position Compensation: $20 for undergraduate students and $25/hour for graduate students Minimum Requirements Education: Current rising UVA fourth-year undergraduate or graduate student Capable of accurately following oral and written instructions, completing tasks promptly and reliably, and exhibiting exceptional attention to detail Excellent organizational and analytical skills Familiarity with qualitative and quantitative methods Application Requirements CV or resume Cover letter Writing sample Questions about the position should be directed to Rachel Wahl at rlw4ck@virginia.edu",
      "responsibilities": "The University of Virginia’s Karsh Institute of Democracy is seeking a Research Assistant to support a mixed-methods study of the Karsh Institute’s Student Dialogue Fellowship (Fellowship), a program that seeks to address the challenge of political polarization by fostering engaged dialogue amongst ideologically diverse college students",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Peabody Hall": [
    {
      "title": "Office Assistant (Student Wage) Federal Work Study",
      "conciseDescription": "We are looking for enthusiastic students to join our team! If you have been approved for Federal Work Study funds for the 2024-2025 Academic Year and are interested in joining our team, please apply. Previous experience is not required. This position starts August 27, 2024 and ends May 9, 2025.",
      "timePosted": "2025-03-25",
      "wage": "$13.50",
      "requirements": "Previous experience is not required",
      "responsibilities": "The Office of Undergraduate Admission, located in Peabody Hall, strives to recruit, support, and enroll exceptionally talented students from all backgrounds, in service of the University and the Commonwealth of Virginia",
      "startDate": "August 27, 2024",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Undergraduate Admission Intern - Federal Work Study Position (Student Wage)",
      "conciseDescription": "*This position is specifically for students who qualify for Federal Work Study. If you do not qualify for FWS but are interested in becoming an Admission Intern, more openings will be posted in late February 2025 for summer and fall positions.* The Office of Undergraduate Admission is hiring undergraduate interns for the Spring of 2025 (now through May 9). Interns are responsible for welcoming guests and leading our office’s daily tours for prospective students, admitted students, and visiting groups.",
      "timePosted": "2025-01-31",
      "wage": "$15.00",
      "requirements": "MINIMUM REQUIREMENTS Education: Current undergrad UVA student, eligible for Federal Work-Study Availability: Must be available for at least three tour shifts a week",
      "responsibilities": "- Participate in training and professional development activities",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    }
  ],
  "Bryan Hall": [
    {
      "title": "Student Instructor Assistant (SIA), ARCH/GSVS 2150 GLOBAL SUSTAINABILITY (Student Wage)",
      "conciseDescription": "This is an excellent opportunity for graduate students from any discipline to gain a deeper knowledge of sustainability. Cross-listed in Global Studies, Architecture, and Commerce, this interdisciplinary course is the required foundation for both the Global Environments + Sustainability major and Global Sustainability minor. Professors from environmental science, philosophy, medicine, architecture, engineering, commerce, and other disciplines lecture throughout the semester and approx.",
      "timePosted": "2025-03-25",
      "wage": "$20",
      "requirements": "Cross-listed in Global Studies, Architecture, and Commerce, this interdisciplinary course is the required foundation for both the Global Environments + Sustainability major and Global Sustainability minor",
      "responsibilities": "Course assistants/graders will gain experience in guiding and grading students",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    }
  ],
  "Booker House": [
    {
      "title": "Student Data Science Analyst (Federal Work Study, Student Wage)",
      "conciseDescription": "The Enrollment Intelligence and Analytics department at the University of Virginia is seeking qualified applicants for the position of Student Data Science Analyst. This is a Federal Work Study eligible position with a flexible schedule of less than 20 hours per week during the academic semester and up to 40 hours per week during the summer months and university breaks. This Federal work Study Position is open to both undergraduate and graduate students.",
      "timePosted": "2025-03-25",
      "wage": "$17.00",
      "requirements": "Preferred Qualifications: While not required, knowledge or experience in the following areas is highly desirable: Data visualization tools such as Power BI or Tableau",
      "responsibilities": "Key Responsibilities: Assist in creating interactive dashboards and reports to support enrollment decision-making",
      "startDate": "Spring 20",
      "eligibility": "Federal Work Study"
    }
  ],
  "2400 Old Ivy Road": [
    {
      "title": "Community Resilience Research Assistant (Student Wage)",
      "conciseDescription": "The Institute for Engagement + Negotiation (IEN) is hiring an SRA to support the Resilience Action Feasibility Tool (RAFT), (a 3 university collaborative that helps Virginia’s localities and Tribes improve their resilience) as they begin work in the Historic Triangle in Hampton Roads. This position will allow an SRA to gain hands-on experience working with communities in policy, planning, and climate adaptation as part of the RAFT’s 3-step process: (1) quantitative and qualitative evaluation using the RAFT scorecard, (2) creation of an opportunity list based on the RAFT scoring, (3) 12-months of implementation of action items. Primary responsibilities Qualitative research and analysis, including stakeholder interviews and focus groups as part of our scoring process Report and meeting summary development Stakeholder mapping and outreach / engagement with RAFT communities and faculty affiliates Critical support for RAFT project management team, including: Coordinating partners to schedule meetings Preparing meeting materials Attending team meetings and workshops Preparing after meeting summaries and notes, and Ensuring proper communication with partners for follow through on action items Facilitation skills development, including leading small group discussions and meetings Time commitment/location: 10-15 hours per week (Academic Year).",
      "timePosted": "2025-03-25",
      "wage": "$16",
      "requirements": "Not specified.",
      "responsibilities": "The Institute for Engagement + Negotiation (IEN) is hiring an SRA to support the Resilience Action Feasibility Tool (RAFT), (a 3 university collaborative that helps Virginia’s localities and Tribes improve their resilience) as they begin work in the Historic Triangle in Hampton Roads",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "IEN Student Research Assistant (SRA) - Chesapeake Bay Stakeholder Engagement (Student Wage)",
      "conciseDescription": "The Institute for Engagement + Negotiation (IEN) is hiring a Student Research Assistant (SRA) to support a project conducting stakeholder engagement as part of an Independent Evaluation of the Chesapeake Bay Stewardship Fund’s Innovative Nutrient and Sediment Reduction Program The SRA will support: Stakeholder mapping and outreach to schedule interviews and focus groups Qualitative research and analysis, including 25 stakeholder interviews and 6 focus groups (4 in person throughout the watershed the week of March 10-14, and 2 virtual) Interview and focus group transcript analysis and report writing Event planning and coordination to support 4 in-person focus groups throughout the Chesapeake Bay Watershed IEN project management, including: coordinating with partners to schedule meetings/interviews, preparing meeting and/or interview or focus group materials, attending team meetings and events, and preparing after meeting summaries and notes. The pay rate is $16.00/hr. Please contact Kelly Altizer, kaltizer@virginia.edu, with questions related to this position.",
      "timePosted": "2025-03-24",
      "wage": "$16.00",
      "requirements": "Not specified.",
      "responsibilities": "The Institute for Engagement + Negotiation (IEN) is hiring a Student Research Assistant (SRA) to support a project conducting stakeholder engagement as part of an Independent Evaluation of the Chesapeake Bay Stewardship Fund’s Innovative Nutrient and Sediment Reduction Program The SRA will support: Stakeholder mapping and outreach to schedule interviews and focus groups Qualitative research and analysis, including 25 stakeholder interviews and 6 focus groups (4 in person throughout the watershed the week of March 10-14, and 2 virtual) Interview and focus group transcript analysis and report writing Event planning and coordination to support 4 in-person focus groups throughout the Chesapeake Bay Watershed IEN project management, including: coordinating with partners to schedule meetings/interviews, preparing meeting and/or interview or focus group materials, attending team meetings and events, and preparing after meeting summaries and notes",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Telephone Interviewer (Student Wage)",
      "conciseDescription": "Overview – The Center for Survey Research (CSR) was founded in 1988 and has grown into a full-service academic survey research facility. The vast majority of studies conducted by CSR are on behalf of public institutions, primarily local governments and state agencies. CSR does not conduct any sales calls or partisan political research.",
      "timePosted": "2023-07-09",
      "wage": "$15.00",
      "requirements": "Prior Experience – No prior experience required",
      "responsibilities": "Not specified.",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Hotel D": [
    {
      "title": "Undergraduate Student Teaching Consultants (Student Wage)",
      "conciseDescription": "The Center for Teaching Excellence is hiring undergraduate students to serve as teaching consultants. Undergraduate Student Teaching Consultants (USTCs) will draw on their unique perspectives as students and learn to communicate this expertise effectively to faculty. USTCs will be trained to consult with UVA instructors this summer and throughout the 2025-2026 academic year.",
      "timePosted": "2025-03-23",
      "wage": "$17",
      "requirements": "REQUIRED QUALIFICATIONS Excellent oral and written communication skills, including listening skills Excellent interpersonal skills, including empathy and compassion Excellent organizational skills, including maintaining a schedule and responding promptly to electronic communications Mature, professional demeanor Interest in college education Interest in serving as a liaison between students and faculty ELIGIBILITY All UVA undergraduate students enrolled in 12 credit hours or more are eligible to apply",
      "responsibilities": "Attend student-faculty partnership events for continued development and training as schedule allows",
      "startDate": "Fall 20",
      "eligibility": "Student Wage"
    }
  ],
  "Monroe Hall": [
    {
      "title": "Office Assistant (Student Wage)",
      "conciseDescription": "The Office for the Undergraduate College of A&S is hiring undergraduate A&S students, for the Summer 2025, to assist with front office duties, including: Greeting students and other guests Answering phones Making appointments for Association Deans Providing basic information Helping with all aspects of College forms Other tasks as assigned We are looking for students that will be able to work at least 5 hours a week, preferably in blocks of at least two hours between the hours of 9:30am and 4pm. We hope to find students that would like to continue to work during the academic year. Students who will be eligible for federal work-study for the 2025-2026 academic year are encouraged to apply.",
      "timePosted": "2025-03-21",
      "wage": "$15.00",
      "requirements": "Not specified.",
      "responsibilities": "The Office for the Undergraduate College of A&S is hiring undergraduate A&S students, for the Summer 2025, to assist with front office duties, including: Greeting students and other guests Answering phones Making appointments for Association Deans Providing basic information Helping with all aspects of College forms Other tasks as assigned We are looking for students that will be able to work at least 5 hours a week, preferably in blocks of at least two hours between the hours of 9:30am and 4pm",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Darden Faculty": [
    {
      "title": "Darden Graduate Statistical Research Assistant [Remote] (Student Wage)",
      "conciseDescription": "The graduate statistical research assistant will support Darden faculty on advanced statistical needs. This may include time series analysis, structural equations modeling, custom code for bootstrapping, and validating survey instruments. Responsibilities: Cleaning and analyzing datasets for faculty Providing interpretations of analysis results Advising on advanced statistical techniques Skills and Abilities: Strong attention to detail Experience with wide range of statistical techniques Ability to learn new statistical techniques and software Strong documentation skills Experience with microeconomics and corporate finance preferred.",
      "timePosted": "2025-03-19",
      "wage": "$19",
      "requirements": "Experience with statistical software is required",
      "responsibilities": "The graduate statistical research assistant will support Darden faculty on advanced statistical needs",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Darden Technical Research Assistant (Remote), Summer 2025 (Student Wage)",
      "conciseDescription": "Darden is hiring research assistants for Summer 2025 who will report directly to Darden faculty or the Office of Research Services. This posting is for multiple positions. Work may include cleaning and parsing data, web scraping, and data documentation.",
      "timePosted": "2025-03-12",
      "wage": "$15.00",
      "requirements": "Position is remote, but student must physically reside in the United States",
      "responsibilities": "Darden is hiring research assistants for Summer 2025 who will report directly to Darden faculty or the Office of Research Services",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Darden General Research Assistant, Summer 2025 (Remote) (Student Wage)",
      "conciseDescription": "Darden is hiring research assistants for the summer who will report either directly to Darden faculty or to associate directors for research initiatives across Darden to provide support for the research work of Darden faculty. Work may include locating and summarizing existing academic literature and policies, constructing data sets based on information collected online, and writing summaries of faculty research for business practitioners. This posting is for multiple positions requiring the same skills.",
      "timePosted": "2025-03-12",
      "wage": "$14",
      "requirements": "This position is remote but must be completed in the United States",
      "responsibilities": "Darden is hiring research assistants for the summer who will report either directly to Darden faculty or to associate directors for research initiatives across Darden to provide support for the research work of Darden faculty",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Faulkner House": [
    {
      "title": "DCTI Assistant (Student Wage)",
      "conciseDescription": "Democracy and Capitalism Teachers Institute Assistant (Student Wage) The University of Virginia’s Project on Democracy and Capitalism is seeking a summer student intern at the undergraduate or graduate level to assist with the 2025 Democracy and Capitalism Teachers Institute. The intern will gain experience in event planning and administrative coordination and communications. They will work with both Democracy and Capitalism staff and faculty and secondary classroom educators participating in the Democracy and Capitalism Teachers Institute.",
      "timePosted": "2025-03-19",
      "wage": "$17.00",
      "requirements": "Not specified.",
      "responsibilities": "Democracy and Capitalism Teachers Institute Assistant (Student Wage) The University of Virginia’s Project on Democracy and Capitalism is seeking a summer student intern at the undergraduate or graduate level to assist with the 2025 Democracy and Capitalism Teachers Institute",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Skipwith Hall": [
    {
      "title": "Sustainability Student Employee (Student Wage)",
      "conciseDescription": "Sustainability Student Employees (SSEs) are dedicated to integrating sustainability into the UVA community. They work in six teams focused on key sustainability areas: Waste Minimization, Green Living, Outreach, Green Athletics, and Service Learning. Through events and programs, SSEs help coordinate and communicate the University’s sustainability efforts to peers and the broader UVA community.",
      "timePosted": "2025-03-17",
      "wage": "$15",
      "requirements": "Since advocacy is central to the role, candidates should feel comfortable engaging with individuals across Grounds",
      "responsibilities": "Through events and programs, SSEs help coordinate and communicate the University’s sustainability efforts to peers and the broader UVA community",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Newcomb Hall": [
    {
      "title": "Student Engagement CIO Support Intern - Federal Work-Study Position (Student Wage)",
      "conciseDescription": "The Student Engagement CIO Support Intern position will assist in administrative and programming duties to support the Student Engagement Office. This position will work to increase involvement and to enhance students’ collegiate experience by supporting Student Engagement CIO initiatives. GENERAL RESPONSIBILITIES Gain a deep familiarity with the Student Engagement platform Hoo’s Involved and its various features for student organizations Facilitate training sessions for CIOs and other organizations.",
      "timePosted": "2025-03-13",
      "wage": "$12.41",
      "requirements": "SKILLS AND QUALIFICATIONS Must be eligible for a Federal Work Study award that can be applied to this role Must be willing to work mornings/nights/weekend shifts as required Excellent customer service and time management skills Ability to communicate and partner with a diverse group of stakeholders Ability to work independently and take initiative Excellent oral and written communication skills Dependable, punctual, and responsible Organized and able to multi-task Ability to act as a team member Ability to attend mandatory trainings, staff meetings, one-on-one meetings with your supervisor, and other activities that may be outside of your work schedule Must be able to perform moderately heavy physical duties (i.e., lifting and setting up equipment up to 30 lbs.) Valid Driver’s License Anticipated Assignment Dates: ASAP - May 9, 2025 Position Compensation: $12.41 Hourly Location: This position will be in Newcomb Hall Programs and Councils space",
      "responsibilities": "The Student Engagement CIO Support Intern position will assist in administrative and programming duties to support the Student Engagement Office",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Operations Assistant, Summer 2025 (Student Wage)",
      "conciseDescription": "The Operation Assistant will support the general operations of Newcomb Hall & 1515 and associated facilities around Grounds including both student activity and academic spaces. Operations Assistants will provide front-line customer service and reception for students, faculty, staff, and visitors. The Assistants will complete specific projects and duties in support of the day-to-day operations of the office.",
      "timePosted": "2025-03-07",
      "wage": "$12.41",
      "requirements": "Operations Assistants will be required to assist with all departmental functions and at all locations as required",
      "responsibilities": "The Operation Assistant will support the general operations of Newcomb Hall & 1515 and associated facilities around Grounds including both student activity and academic spaces",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Audio-Visual Assistant (Student Wage)",
      "conciseDescription": "The Audio-Visual (AV) Assistants’ primary responsibility is to provide audio-visual services and technological support in Newcomb Hall, satellite spaces managed through Event Management, and the 1515 Building. AV Assistants respond promptly to requests for technical support for events and activities in these spaces and troubleshoot issues and complications as they arise. AV Assistants also are responsible for the setup, operation, and breakdown of equipment as needed.",
      "timePosted": "2025-01-13",
      "wage": "$14.53",
      "requirements": "Complete all required training to become familiar with projectors, sound systems, microphones, AV control systems, video conferencing, lighting equipment and other AV resources as needed",
      "responsibilities": "The Audio-Visual (AV) Assistants’ primary responsibility is to provide audio-visual services and technological support in Newcomb Hall, satellite spaces managed through Event Management, and the 1515 Building",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Event Planning Student Assistant - Work Study Position (Student Wage)",
      "conciseDescription": "The Event Planning Student Assistant will support the general operations of the Event Planning Services department by providing front-line customer service and reception for students, faculty, and staff. The Assistants will complete specific projects and duties for the professional Event Planning Services Staff in support of the day-to-day operations of the office. Provide administrative support by answering phones, replying to emails, greeting visitors, answering routine questions to determine needed resources, make referrals, and provide information on events, policies, systems, and office services.",
      "timePosted": "2025-01-03",
      "wage": "$12.41",
      "requirements": "Excellent customer service skills and professional work habits Ability to communicate and partner with a diverse group of stakeholders Ability to work independently and take initiative Excellent oral and written communication skills Dependable and responsible Organized and able to multi-task Ability to act as a team member Must be Federal Work Study Student Education: Current work-study eligible UVA student Experience: None Licensure: None The University of Virginia, including the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff",
      "responsibilities": "The Event Planning Student Assistant will support the general operations of the Event Planning Services department by providing front-line customer service and reception for students, faculty, and staff",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Newcomb Hall Ambassador - Federal Work-Study Position (Student Wage)",
      "conciseDescription": "Student Engagement is seeking students to serve as Newcomb Hall Ambassadors. Student Engagement and Event Management support Newcomb Hall and the associated facilities around grounds to provide spaces which build community and support student organizations, their leaders, and events. Newcomb Hall is often called the “Front Door” to Central Grounds – serving as a main passageway for campus visitors and community members alike.",
      "timePosted": "2024-12-17",
      "wage": "$12.41",
      "requirements": "Responsibilities: Staff the Newcomb Hall Information (and Service/Welcome) Desks Provide exceptional customer service to all clients/guests/community members Promote events/services within Newcomb Hall and our associated facilities Develop and implement passive programs at the Information Desks Fulfil printing requests submitted by Student Organizations Provide administrative support by answering phones, greeting visitors, giving directions, and providing information on events, policies, systems, and services Process lost & found and equipment check-out as needed Support event setups/building operations as needed Attend regular staff meetings with team and one-on-ones with Supervisor Enforce departmental and facility policies and procedures Work all assigned shifts and be willing to cover other shifts as needed to ensure full coverage Other duties as assigned Hourly Rate: $12.41/hour Skills/Qualifications: Must be eligible for a Federal Work Study award that can be applied to this role Must be willing to work mornings/nights/weekend shifts as required Excellent customer service and time management skills Ability to communicate and partner with a diverse group of stakeholders Ability to work independently and take initiative Excellent oral and written communication skills Dependable, punctual, and responsible Organized and able to multi-task Ability to act as a team member Ability to attend mandatory Event Services’ staff trainings, staff meetings, one-on-one meetings with your supervisor, and other activities that may be outside of your work schedule Must be able to perform moderately heavy physical duties (i.e., lifting and setting up equipment up to 30 lbs.) Valid Driver’s License Education: Current undergrad UVA student Experience: None Licensure: Valid Driver's License Outcomes: As a result of employment with Student Affairs, employees will: Gain practical experience to develop career ready skills",
      "responsibilities": "Student Engagement and Event Management support Newcomb Hall and the associated facilities around grounds to provide spaces which build community and support student organizations, their leaders, and events",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Operation Assistant - Federal Work-Study Position (Student Wage)",
      "conciseDescription": "Event Management helps the UVA community achieve their event goals by providing the place, resources, and connections needed to safely and thoughtfully bring people together. The Operation Assistant will support the general operations of Newcomb Hall & 1515, and associated facilities around Grounds including both student activity and academic spaces. Operations Assistants will provide front-line customer service and reception for students, faculty, staff, and visitors.",
      "timePosted": "2024-07-18",
      "wage": "$13.50",
      "requirements": "Applicants must have been awarded a federal work-study award for the 2024-2025 academic year",
      "responsibilities": "The Operation Assistant will support the general operations of Newcomb Hall & 1515, and associated facilities around Grounds including both student activity and academic spaces",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    }
  ],
  "Shumway Hall": [
    {
      "title": "Help Desk Student Worker (Student Wage)",
      "conciseDescription": "The McIntire School of Commerce Help Desk is currently seeking students to handle tier 1 IT issues and administrative duties during the 2025-2026 academic year. Students primarily work in the Help Desk office but may be assigned to other areas of the school as well. The McIntire Help Desk office hours are: Monday through Friday: 8am-9pm Saturday: 10am-6pm Sunday: 12pm-9pm The McIntire Info Desk hours are: Monday through Friday: 8am-5pm Duties will include, but are not limited to: face-to-face customer interaction, answering phones, basic IT tier 1 level troubleshooting, data entry in ticketing system, maintaining equipment, etc.",
      "timePosted": "2025-03-12",
      "wage": "$15.00",
      "requirements": "Students are expected to work 10 – 20 hours per week, depending on individual class schedules, and must work a minimum of one Friday night/weekend shift per month",
      "responsibilities": "The McIntire Help Desk office hours are: Monday through Friday: 8am-9pm Saturday: 10am-6pm Sunday: 12pm-9pm The McIntire Info Desk hours are: Monday through Friday: 8am-5pm Duties will include, but are not limited to: face-to-face customer interaction, answering phones, basic IT tier 1 level troubleshooting, data entry in ticketing system, maintaining equipment, etc",
      "startDate": "August 25",
      "eligibility": "Student Wage"
    }
  ],
  "North Grounds Recreation Ctr": [
    {
      "title": "Facility Operations Assistant, North Grounds, Summer 2025 (Student Wage)",
      "conciseDescription": "University of Virginia Department of Recreation We offer a variety of programs, services and spaces where our students, faculty and staff feel welcome and safe, can find meaningful connections and develop all dimensions of wellness (social, intellectual, physical, emotional, spiritual, financial and occupational) that enrich the learning, living, teaching and working experiences at UVA Job Description: Facility Operations Assistant Team Members Responsibility: Take Pride in being a Student Employee in the University of Virginia Department of Recreation (UVA Rec). Establish a service focused rapport and relationship with Student and Departmental Staff, Members and Guest of the Facility. Promote Exceptional Customer Service to create a positive environment for members and guests.",
      "timePosted": "2025-03-10",
      "wage": "$12.50",
      "requirements": "Not specified.",
      "responsibilities": "University of Virginia Department of Recreation We offer a variety of programs, services and spaces where our students, faculty and staff feel welcome and safe, can find meaningful connections and develop all dimensions of wellness (social, intellectual, physical, emotional, spiritual, financial and occupational) that enrich the learning, living, teaching and working experiences at UVA Job Description: Facility Operations Assistant Team Members Responsibility: Take Pride in being a Student Employee in the University of Virginia Department of Recreation (UVA Rec)",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Morven Farm Pigeon Coop Guest House": [
    {
      "title": "MKG Farm Crew Intern (Student Wage)",
      "conciseDescription": "Morven Kitchen Garden 2025 Student Farm Crew Internships Morven Kitchen Garden (MKG) is looking for UVA students passionate about food, farming, and community to join our 2025 Student Farm Crew as summer season interns. In these paid positions, students will gain hands-on experience in sustainable agriculture and learn about all aspects of farming: crop selection and season planning, soil health, resource management, budgeting, and business administration. Additionally, interns will gain experience engaging with the community through volunteer coordination, educational workshops, and team building events, as well as food security outreach.",
      "timePosted": "2025-03-10",
      "wage": "$15",
      "requirements": "Weekly Hours: 20 hours per week during the Summer season; must work a consistent weekly schedule within the Monday-Friday 8am-5pm timeframe",
      "responsibilities": "This job will entail working with fellow student crew members to maintain MKG programming and accomplish regular garden tasks with independence: Being part of a student leadership team: imagining new initiatives, grant writing of seeking funding for projects, coordinating with Morven Programs staff to facilitate workshops, guest speakers, and community engagement Working in the field to plant, weed, maintain, and harvest crops Planning and executing fun and engaging volunteer service activities and events in our garden for students and community members Learning about small-scale sustainable agriculture through hands-on learning and independent research projects Curating a selection of produce for our wholesale, retail, and donation clients",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Michie South": [
    {
      "title": "DocuSign Forms and Process Administrator Student Worker - Remote (Student Wage)",
      "conciseDescription": "The ITS Document Services team is currently seeking a detail-oriented and motivated student to join their team as a DocuSign Forms and Process Administrator. In this role, you will be responsible for assisting in creating and migrating forms and processes to digital formats. Duties will include designing, developing and testing DocuSign electronic form templates and process automation.",
      "timePosted": "2025-03-07",
      "wage": "$15.00",
      "requirements": "The ideal candidate should be proficient in Microsoft Office and Adobe Acrobat, have excellent attention to detail, and be able to work independently",
      "responsibilities": "In this role, you will be responsible for assisting in creating and migrating forms and processes to digital formats",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Edgar Shannon Library": [
    {
      "title": "Arts and Humanities Graduate Library Assistant (Student Wage)",
      "conciseDescription": "The Arts and Humanities Team at the University of Virginia Library seeks a Graduate Assistant to support various library projects including a review and update of the library’s A-Z Databases List. This position is a great opportunity for graduate students interested in information management and academic libraries. In this role, the graduate assistant will collaborate closely with library professionals and gain insight into the inner workings of a large academic library system.",
      "timePosted": "2025-03-05",
      "wage": "$21.98",
      "requirements": "Primary Responsibilities: Review databases on the library’s A-Z Databases list to ensure databases are assigned the most appropriate subject categories based on content, scope, and disciplinary relevance Making recommendations to add, modify, or remove categories based on the content of the databases Identify and correct any instances of incorrect or inconsistent categorization, ensuring all databases are properly labeled for efficient searching Work closely with project team to follow guidelines for categorization and database review Participate in regular meetings with project team to discuss progress and address any issues encountered during the review process Support librarians with other project as needed This is primarily a sedentary job that requires extensive use of desktop computers Minimum Requirements: Bachelor's Degree Currently enrolled as a graduate student at the University of Virginia Familiarity with academic library databases and e-resources Experience using Microsoft Word and Excel as well as Google Docs Strong organizational skills and attention to detail Ability to work independently and manage time effectively Strong written communication skills, with the ability to follow instructions clearly and provide feedback when necessary To Apply: Interested applicants should submit the following: A current resume or CV A brief cover letter explaining your interest in the position and any relevant experience from your coursework, internships, or other work history A list of 2-3 references MINIMUM REQUIREMENTS Education: Bachelor's degree",
      "responsibilities": "The Arts and Humanities Team at the University of Virginia Library seeks a Graduate Assistant to support various library projects including a review and update of the library’s A-Z Databases List",
      "startDate": "March 20",
      "eligibility": "Student Wage"
    }
  ],
  "Aquatic & Fitness Center": [
    {
      "title": "AFC Facility Assistant (SUMMER 2025) (Student Wage)",
      "conciseDescription": "University of Virginia Department of Recreation We offer a variety of programs, services and spaces where our students, faculty and staff feel welcome and safe, can find meaningful connections and develop all dimensions of wellness (social, intellectual, physical, emotional, spiritual, financial and occupational) that enrich the learning, living, teaching and working experiences at UVA. Job Description: Facility Service Assistant Team Members Responsibility: Take Pride in being a Student Employee in the University of Virginia Department of Recreation (UVA Rec). Establish a service focused rapport and relationship with Student and Departmental Staff, Members and Guest of the Facility.",
      "timePosted": "2025-03-03",
      "wage": "$12.50",
      "requirements": "Not specified.",
      "responsibilities": "University of Virginia Department of Recreation We offer a variety of programs, services and spaces where our students, faculty and staff feel welcome and safe, can find meaningful connections and develop all dimensions of wellness (social, intellectual, physical, emotional, spiritual, financial and occupational) that enrich the learning, living, teaching and working experiences at UVA",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Intramural Sports (Intramural Sports Official or Intramural Sport Supervisor) (Student Wage)",
      "conciseDescription": "Intramural Sport Official: Area Specific Responsibilities: Assist with venue set-up and take-down Assist in the signing-up of Intramural teams and verification of their eligibility Assist in examining facility for safety hazards Officiate Intramural contests and enforce the rules as judiciously as possible Oversee the Intramural contest and ensure participation takes place in a safe manner Report necessary accounts of major/technical fouls, yellow cards, etc. Assist in completing required scoresheets or daily reports Assist in storing any equipment at the conclusion of the day's/night's activities Assist in securing the facility at the conclusion of the Intramural activity Requirements/Qualifications: All Intramural Officials must be currently enrolled students at the University of Virginia Work a minimum of 5 hours per week Wear appropriate uniform and assigned official’s jersey while on duty Attend all mandatory trainings and meetings for all sports you intend to officiate Good interpersonal skills and the ability to relate with peers Compensation: $13.00/hour. Intramural Sport Supervisor Area Specific Responsibilities: Assist in pre-game duties, including assigning Intramural Officials to their partners and their field/court Complete necessary online daily reports Oversee Intramural contests and ensure participation takes place in a safe manner Diffuse any potential issues involving participants, coaches, and spectators Provide training and support for the Intramural Officials Officiate contests when necessary Secure facility at the conclusion of the Intramural activity Requirements/Qualifications: Work a minimum of 10 hours per week A willingness to become certified in CPR, AED, and First Aid Have the desire to gain a thorough knowledge of all Intramural Sports Handbooks Attend all mandatory meetings Assist in pre- and post-season duties, such as program promotion and Officials’ evaluations Attend and actively participate in officials’ training for all sports Stay active in officiating Compensation: $14.50/hour.",
      "timePosted": "2024-10-16",
      "wage": "$13.00",
      "requirements": "Assist in completing required scoresheets or daily reports Assist in storing any equipment at the conclusion of the day's/night's activities Assist in securing the facility at the conclusion of the Intramural activity Requirements/Qualifications: All Intramural Officials must be currently enrolled students at the University of Virginia Work a minimum of 5 hours per week Wear appropriate uniform and assigned official’s jersey while on duty Attend all mandatory trainings and meetings for all sports you intend to officiate Good interpersonal skills and the ability to relate with peers Compensation: $13.00/hour",
      "responsibilities": "Intramural Sport Official: Area Specific Responsibilities: Assist with venue set-up and take-down Assist in the signing-up of Intramural teams and verification of their eligibility Assist in examining facility for safety hazards Officiate Intramural contests and enforce the rules as judiciously as possible Oversee the Intramural contest and ensure participation takes place in a safe manner Report necessary accounts of major/technical fouls, yellow cards, etc",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Swim Instructor (Student Wage)",
      "conciseDescription": "The Department of Intramural-Recreational Sports, a division of Athletics at the University of Virginia, is seeking qualified applicants for the position of Swim Instructor (part-time, wage position). Swim Instructors work at both the Aquatic & Fitness and North Grounds Recreation Center aquatics facilities. Applicants must be self-motivated and desire to work in a team environment.",
      "timePosted": "2024-09-10",
      "wage": "$13.00 - $18.00",
      "requirements": "Applicants must be self-motivated and desire to work in a team environment",
      "responsibilities": "Join our swim instructor team and work in a fun, social environment with flexible hours! Identify key elements and strategies for planning and preparing effective and safe swim lessons Identify key class management principles, elements and strategies for planning, preparing and conducting safe swim lessons Describe the importance of effective observation for teaching and how to develop these methods Observe swimming, headfirst entry and diving skills and accurately classify them and suggest appropriate interventions to improve them Develop the ability to effectively communicate about participant’s progress in swim lessons Modify teaching to meet unexpected challenges including dealing with participants who misbehave Demonstrate the ability to accommodate participants with disabilities and other health conditions Availability to work evenings and weekends Attend all in-service and training sessions Excellent communication and leadership skills Display excellent customer service in a friendly and helpful manner to all participants and fellow employee Position Compensation: $13.00 - $18.00 per hour MINIMUM REQUIREMENTS Education: Current UVA student Experience: Some experience, up to 1-3 years Licensure: Water Safety Instructor preferred, but not required PHYSICAL DEMANDS This is primarily a sedentary job involving extensive use of desktop computers",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Lifeguard (Student Wage)",
      "conciseDescription": "The Department of Recreation, a division of Athletics at the University of Virginia, is seeking qualified applicants for the position of Lifeguard. Lifeguards work at both the Aquatic & Fitness and North Grounds Recreation Center aquatics facilities. Undergrad and Grad student wage position for less than 20 hours per week during the academic semester and 40 hours per week during the summer months.",
      "timePosted": "2023-10-23",
      "wage": "$14.00",
      "requirements": "Lifeguards will: Supervise the activities of swimmers by enforcing rules and regulations Attend and participate in all staff meetings and in-services Must be willing and able to work scheduled university breaks including Fall Break, November, Winter Break, Spring Break, and Summer Must be willing to work some opening and closing shifts when available Work a minimum of 2-4 shifts per month Maintain scheduled shifts and provide supervision of entire pool area, including locker rooms Assist in cleaning and maintaining the pool and related areas and facilities Warn swimmers of improper activities or hazards, answer any questions pertaining to pool",
      "responsibilities": "Lifeguards will: Supervise the activities of swimmers by enforcing rules and regulations Attend and participate in all staff meetings and in-services Must be willing and able to work scheduled university breaks including Fall Break, November, Winter Break, Spring Break, and Summer Must be willing to work some opening and closing shifts when available Work a minimum of 2-4 shifts per month Maintain scheduled shifts and provide supervision of entire pool area, including locker rooms Assist in cleaning and maintaining the pool and related areas and facilities Warn swimmers of improper activities or hazards, answer any questions pertaining to pool",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "College at Wise": [
    {
      "title": "College Services Generalist",
      "conciseDescription": "The University of Virginia’s College at Wise (UVA Wise located in Wise, Virginia) would like to invite applications for the position of Buyer & College Services Generalist. The College Services Department seeks a qualified candidate who has excellent oral and written skills and can manage multiple tasks in an ever-changing environment. A successful candidate should be able to maintain a high level of attention to detail and work daily with a broad spectrum of people from suppliers to internal departments.",
      "timePosted": "2025-02-27",
      "wage": "N/A",
      "requirements": "A successful candidate should be able to maintain a high level of attention to detail and work daily with a broad spectrum of people from suppliers to internal departments",
      "responsibilities": "A successful candidate should be able to maintain a high level of attention to detail and work daily with a broad spectrum of people from suppliers to internal departments",
      "startDate": "Not specified.",
      "eligibility": "Not specified."
    },
    {
      "title": "Emmett F. and N. Alys Low Endowed Chair Professorship in Physics",
      "conciseDescription": "The University of Virginia’s College at Wise, a division of the University of Virginia located in Wise, Virginia, invites applications for the Emmett F. and N. Alys Low Professorship in Physics.",
      "timePosted": "2023-07-18",
      "wage": "N/A",
      "requirements": "Applicants must have an exemplary history of teaching at the undergraduate level and a demonstrated commitment to the promotion of science education",
      "responsibilities": "This position is a full-time, 9-month commitment with the potential for summer teaching and research support",
      "startDate": "August 20",
      "eligibility": "Graduate Student"
    },
    {
      "title": "Assistant Coach-WAGE",
      "conciseDescription": "The part-time (wage) assistant coach provides assistance in specific aspects of coaching the Division II sport program including but not limited to: student-athlete recruitment, practice preparation and setup, and player development. This posting will support applications for Assistant Coaches (WAGE) for the following sports at UVA Wise: Football Women's Volleyball Women's Basketball Men's Basketball Women's Lacrosse Baseball Softball Tennis Golf Cross Country/Track & Field Assist in various aspects of the intercollegiate sport program to including but not limited to: • Attend practices and player conditioning • Participate actively in practices • Support student-athletes academic experience • Create a positive and productive environment • Travel to away games and attend home games • Keep track of special statistics at games and practice • Communicate effectively and appropriately • Maintain confidentiality of records and information • Provide feedback to coach regarding players and team as necessary • Assist with set up and clean up of facilities before/after practices • Offer suggestions, guidance and information to athletes relating to the game and play • Provide encouragement and support • Help organize the team for practices and games • Communicate with Head Coach(es) any relevant issues or problems. • Assist with office duties as assigned • Actively listening and learning various sport specific techniques as instructed by coaches • Actively listening and learning various game strategies as instructed by coaches • Maintain social media accounts and create graphics to promote the program In addition to the above job responsibilities, other duties may be assigned.",
      "timePosted": "2023-07-10",
      "wage": "N/A",
      "requirements": "Not specified.",
      "responsibilities": "The part-time (wage) assistant coach provides assistance in specific aspects of coaching the Division II sport program including but not limited to: student-athlete recruitment, practice preparation and setup, and player development",
      "startDate": "Not specified.",
      "eligibility": "Not specified."
    }
  ],
  "8095 Innovation Park Drive": [
    {
      "title": "UVA|Northern Virginia Inspire Instructor (Staff Wage and Student Wage)",
      "conciseDescription": "Overview UVA|Northern Virginia is hosting its Summer Programming in Northern Virginia during Summer 2025. This program is for high school students (rising 10-12 grade) and will run Summer 2025. It bridges the gap between curriculum and interest-based learning and will offer in-person (Fairfax, VA) programming.",
      "timePosted": "2025-02-25",
      "wage": "$4",
      "requirements": "The instructor should plan to be in the classroom 30 minutes before the start of class",
      "responsibilities": "Instructors are responsible for designing a curriculum grounded in learning objectives, developing a syllabus, and delivering instruction",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Graduate Office Assistant (Student Wage)",
      "conciseDescription": "The UVA Northern Virginia team is seeking a currently enrolled graduate student to support office operations at our new co-learning space in Fairfax, Virginia. This role will support the Office Manager by maintaining a welcoming environment, running the front reception desk and ensuring smooth daily operation primarily during evening and weekend hours in a part-time capacity. Launched as part of UVA’s 2030 Great and Good Strategic Plan, the mission of UVA | Northern Virginia is to connect Grounds in Charlottesville with Northern Virginia and vice versa.",
      "timePosted": "2024-12-17",
      "wage": "$22.00",
      "requirements": "Required Qualifications Current graduate student enrolled at UVA",
      "responsibilities": "The UVA Northern Virginia team is seeking a currently enrolled graduate student to support office operations at our new co-learning space in Fairfax, Virginia",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "UVA Northern Virginia Inspire Teaching Assistant (Student Wage)",
      "conciseDescription": "UVA | Northern Virginia is hosting its Inspire Program for High School students in Northern Virginia during Summer 2025. Inspire is for high school students (rising 10-12 grades) and will run June 16 – July 25, 2025. Inspire bridges the gap between curriculum and interest-based learning and will offer both in-person (Fairfax, VA) and online programming.",
      "timePosted": "2024-11-14",
      "wage": "$22",
      "requirements": "8am – 4.30pm Monday- Friday Three 1-hour orientations before the start of the course This is an in-person position, so the ability to commute to Fairfax, Virginia is required",
      "responsibilities": "We are looking for Teaching Assistants (TAs) to support in-person and online courses in Northern Virginia (Fairfax, VA)",
      "startDate": "December 1",
      "eligibility": "Student Wage"
    }
  ],
  "Remote - Virginia": [
    {
      "title": "Web Assistant (Student Wage)",
      "conciseDescription": "The College and Graduate School of Arts & Sciences is seeking Web Assistants to support the School in creating and managing content on websites for A&S faculty, departments, and programs. This position offers an opportunity to gain hands-on experience with web development, content management, and digital accessibility. Responsibilities: Content Migration & Web Development: Assist in migrating and organizing content for department and program sites using Drupal.",
      "timePosted": "2025-02-18",
      "wage": "$15",
      "requirements": "This is not required",
      "responsibilities": "The College and Graduate School of Arts & Sciences is seeking Web Assistants to support the School in creating and managing content on websites for A&S faculty, departments, and programs",
      "startDate": "March 1, 2025",
      "eligibility": "Federal Work Study"
    }
  ],
  "Gibbons House": [
    {
      "title": "Head Resident Community Advisor and Program Assistant (Graduate Student Wage)",
      "conciseDescription": "The Office of Summer & Special Academic Programs is seeking a graduate student to serve as the Program Assistant and Head Resident Community Advisor for the UVA Advance summer program. UVA Advance is a residential program for rising high school juniors and seniors. Students live in a residence hall on Grounds during Summer Session III and take two, 3-credit classes.",
      "timePosted": "2025-02-13",
      "wage": "$4",
      "requirements": "All days must be in-person in the assigned residence hall",
      "responsibilities": "The Office of Summer & Special Academic Programs is seeking a graduate student to serve as the Program Assistant and Head Resident Community Advisor for the UVA Advance summer program",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Resident Community Advisor (RCA) (Student Wage)",
      "conciseDescription": "The Office of Summer & Special Academic Programs is seeking undergraduate students to serve Resident Community Advisors (RCAs) for the UVA Advance summer program. UVA Advance is a residential program for rising high school juniors and seniors. Students live in a residence hall on Grounds during Summer Session III and take two, 3-credit classes.",
      "timePosted": "2025-02-13",
      "wage": "$1",
      "requirements": "All dates must be in-person in the assigned residence hall",
      "responsibilities": "Compensation: $1,625 to be paid in two instalments via Period Activity Pay Position Allowances: Housing (single room in residence hall) and dining plan Parking pass and AFC access (if applicable) Duties and Responsibilities: Reside in Gibbons Hall during entirety of program (July 10-August 9) RCAs may take classes or work another part-time job during daytime hours, but are required to be present in the residence hall during evening and overnight hours RCAs must be available for the following daytime hours: Friday, July 11 and Saturday, July 12 (all day): RCA staff training and student arrival Sunday, July 13 (morning only): Team Building Field Day Two Saturday excursions during the course of the program (exact dates and times to be coordinated with Head RCA) Enforce University and program rules and policies, (including nightly curfew) Provide supervision of program participants and communicate concerns and needs in a clear and timely manner to the Head RCA and Program Director Conduct meetings with program participants Maintain an active presence in the program community and seek opportunities to build relationships with students Possess willingness and ability to operate on-call for emergencies Qualifications: UVA undergraduate student in good standing, with a minimum GPA of 2.25 Ability to reside on-site in Gibbons Hall for duration of program (July 10-August 9) Ability to communicate effectively in both written and oral format Strong interpersonal skills and experience working with University staff and students Preferred Qualifications: Prior experience as a Resident Advisor at UVA or similar residential program Experience with adolescents ages 15-18 Understanding of teenage mental, social, and emotional development Application Process: Submit resume, cover letter, and contact information for two professional references",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Conference Supervisor (Student Wage)",
      "conciseDescription": "Conference Supervisors (CS) are responsible for assisting with the planning for our upcoming 2025 summer conference season, as well as with the supervision of the summer conference operations team, coordination of event-related logistics, day-to-day operational tasks, information management, and record keeping in the conference software program StarRez. They will serve as a conference expert for an assigned group of summer conference programs, providing exceptional customer service and performing tasks related to those programs including client communications, rosters, key and dining card management, room inspections, linen distribution if needed, and other relevant tasks. Conference Supervisors will also assist with the recruitment, hiring and training of our summer student team.",
      "timePosted": "2024-10-25",
      "wage": "$15.00",
      "requirements": "Because our office is open 7 days a week from mid-May to mid-August, Conference Supervisors will be required to work a flexible hourly schedule, which will include assigned weekend rotations, some evenings and possibly holidays",
      "responsibilities": "Conference Supervisors (CS) are responsible for assisting with the planning for our upcoming 2025 summer conference season, as well as with the supervision of the summer conference operations team, coordination of event-related logistics, day-to-day operational tasks, information management, and record keeping in the conference software program StarRez",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Rotunda": [
    {
      "title": "Student Affairs Research Assistant – Storytelling (Student Wage)",
      "conciseDescription": "Position Overview: The AVP for Strategic Initiatives in Student Affairs is seeking a creative and detail-oriented undergraduate Research Assistant (RA) to support a project to gather and document compelling stories about the UVA student experience and the unique tradition of student self-governance. This role offers an exciting opportunity to engage with a wide range of students, develop meaningful narratives, and contribute to enhancing the understanding and visibility of student self-governance at UVA. The ideal candidate will have strong writing and interviewing skills, the ability to connect with a diverse range of individuals, and an enthusiasm for the student experience.",
      "timePosted": "2025-02-12",
      "wage": "$15-18",
      "requirements": "Required Skills and Qualifications: Proven ability to craft compelling, clear, and engaging narratives for diverse audiences",
      "responsibilities": "Position Overview: The AVP for Strategic Initiatives in Student Affairs is seeking a creative and detail-oriented undergraduate Research Assistant (RA) to support a project to gather and document compelling stories about the UVA student experience and the unique tradition of student self-governance",
      "startDate": "February 20",
      "eligibility": "Student Wage"
    },
    {
      "title": "Student Affairs Research Assistant— Data Analysis (Student Wage)",
      "conciseDescription": "Position Overview: The AVP for Strategic Initiatives in Student Affairs is seeking undergraduate or graduate student candidates skilled in data analysis and interested in the UVA student experience for the position of Research Assistant (RA). The RA will assist with data collection, analysis, display and reporting as a part of the Division of Student Affairs’ use of data to assess and enhance key aspects of student life at UVA, and to publish best practices based on what is learned. The ideal candidate will have a strong foundation in statistics and probability, excellent skills in data visualization, familiarity with social network analysis methods, and a demonstrated ability to communicate findings effectively through clear, concise writing.",
      "timePosted": "2025-02-12",
      "wage": "$15-18",
      "requirements": "Required Qualifications: Proficiency in statistical software (e.g., R, Python, SPSS, or SAS) and visualization tools",
      "responsibilities": "Position Overview: The AVP for Strategic Initiatives in Student Affairs is seeking undergraduate or graduate student candidates skilled in data analysis and interested in the UVA student experience for the position of Research Assistant (RA)",
      "startDate": "February 20",
      "eligibility": "Student Wage"
    },
    {
      "title": "Communications Intern/Student-Editor of Connections (Student Wage)",
      "conciseDescription": "The Office of the Vice President and Chief Student Affairs Officer oversees large-scale communications with UVA students. The communications intern assists in those efforts by serving as the student-editor of the Connections newsletter. Connections is distributed weekly to all students when school is in session.",
      "timePosted": "2024-06-20",
      "wage": "$17",
      "requirements": "This should be an original piece of writing representing your best work MINIMUM REQUIREMENTS Education: Current UVA student Experience: None Licensure: None PHYSICAL DEMANDS This is primarily a sedentary job involving extensive use of desktop computers",
      "responsibilities": "The communications intern assists in those efforts by serving as the student-editor of the Connections newsletter",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Biocomplexity Center": [
    {
      "title": "Biocomplexity Computing for Global Challenges Undergraduate Summer Intern (Student Wage)",
      "conciseDescription": "UVA Biocomplexity Institute Summer Undergraduate Internship - Computing for Global Challenges (C4GC) This is an opportunity for UVA undergraduate students desiring to learn about the process of research and team science and how they can make meaningful contributions to solving real-world problems. The UVA Biocomplexity Institute is seeking applications for undergraduate interns for its Computing for Global Challenges (C4GC) program. The C4GC program will run for at least 8 weeks, beginning in early June.",
      "timePosted": "2025-02-10",
      "wage": "$15.00",
      "requirements": "All students must be enrolled at the University of Virginia",
      "responsibilities": "Not specified.",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Work Study Community Location": [
    {
      "title": "Meals on Wheels Office Assistant (Federal Work Study Undergraduate Student Wage)",
      "conciseDescription": "In partnership with Student Financial Services Meals on Wheels of Charlottesville/Albemarle is recruiting a Undergraduate Federal Work Study student to work as an Meals on Wheels Office Assistant. Meals on Wheels is located at 704 Rose Hill Drive Charlottesville Virginia 22903. Meals on Wheels of Charlottesville/Albemarle is an independent, non-profit 501(c)(3) organization that has been serving neighbors since 1977.",
      "timePosted": "2025-02-10",
      "wage": "$20.00",
      "requirements": "Candidates must be Federal Work Study recipients",
      "responsibilities": "In partnership with Student Financial Services Meals on Wheels of Charlottesville/Albemarle is recruiting a Undergraduate Federal Work Study student to work as an Meals on Wheels Office Assistant",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Conservation Assistant (Federal Work Study Graduate Student Wage)",
      "conciseDescription": "In collaboration with Student Financial Services, the Department of Forestry is recruiting for a Graduate Federal Work Study position called Conservation Assistant. The Department of Forestry is located at 900 Natural Resources Drive in Charlottesville, Virginia 22903. This is a hybrid position once the preferred candidate has received the required training.",
      "timePosted": "2024-10-09",
      "wage": "$17.00",
      "requirements": "This is a hybrid position once the preferred candidate has received the required training",
      "responsibilities": "In collaboration with Student Financial Services, the Department of Forestry is recruiting for a Graduate Federal Work Study position called Conservation Assistant",
      "startDate": "October 21",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Visitor Services Assistant Federal Work Study (Undergraduate Student Wage)",
      "conciseDescription": "In partnership with Student Financial Services, Jefferson School African American Heritage Center, is recruiting an undergraduate federal work study student to fill the role of Visitor Services Assistant. The Jefferson School African American Heritage Center is located at 233 4th Street, NW Charlottesville Virginia 22903. The Jefferson School African American Heritage Center is located in the historic Jefferson School City Center, the Jefferson School African American Heritage Center’s mission is to honor and preserve the rich heritage and legacy of the African American community of Charlottesville/Albemarle, Virginia and to promote a greater appreciation for and understanding of the contributions of African Americans and peoples of the Diaspora.",
      "timePosted": "2024-09-04",
      "wage": "$15.00",
      "requirements": "Maintain mailchimp communication with teachers Work at greeter desk either in Café area or upstairs at entrance to exhibition Answer guest questions about JSAAHC programs including information about exhibitions and other programs including membership opportunities Take payments for entry ticket, concessions, and items from museum shop Work with office manager to perform other duties as required Required Knowledge, Skills, Abilities, Experience and Training: The ideal candidate must like working with the public, demonstrate good communication skills",
      "responsibilities": "In partnership with Student Financial Services, Jefferson School African American Heritage Center, is recruiting an undergraduate federal work study student to fill the role of Visitor Services Assistant",
      "startDate": "May 9, 2025",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Graduate Advising Fellow for Human Services - Federal Work Study (Graduate Student Wage)",
      "conciseDescription": "On behalf of Madison House Student Financial Services is accepting applications for a Graduate Student Fellow in Human Services. The ideal candidate would have a strong interest in the Human Services field. All graduate students interested in being considered for this position must request and be eligible to receive federal work study, This is an in-person position only.",
      "timePosted": "2024-09-04",
      "wage": "$17.00",
      "requirements": "All graduate students interested in being considered for this position must request and be eligible to receive federal work study, This is an in-person position only",
      "responsibilities": "Madison House serves as the student volunteer center at the University of Virginia and coordinates community partners, student leaders, and volunteers to address the needs of the community as well as the educational and personal growth objectives of students",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Operations and Project Assistant - Federal Work-Study Position (Undergraduate Student Wage)",
      "conciseDescription": "On behalf of the Community Investment Collaborative, Student Financial Services is accepting applications from Undergraduate Work Study students who are interested in working for Community Investment Collaborative located at 300 Preston Ave Suite 206 Charlottesville Virginia 22902. This position is considered an in-person only position. Organization description: The Community Investment Collaborative (CIC) is a nonprofit organization that specializes in micro-enterprise development and offers micro-financing and business training to small and micro-enterprises in Charlottesville and the surrounding counties.",
      "timePosted": "2024-07-23",
      "wage": "$15.00",
      "requirements": "Qualifications: Curiosity/interest in learning Interest in working with others and teams Interest in marketing (social media, email newsletters, website management) Interest in event planning and coordination Interest in small business and entrepreneurship Interest in helping individuals from low-income backgrounds Strong communication skills Strong writing skills, interest in grant writing Strong technology skills (G Suite, Microsoft Office) Ability to manage multiple projects at one time Interest and/or experience in working with business financial statements Schedule: The work-study students will collaborate with the site supervisor to establish a mutually agreeable, required, and consistent schedule of 10 hours per week during the academic year",
      "responsibilities": "Organization description: The Community Investment Collaborative (CIC) is a nonprofit organization that specializes in micro-enterprise development and offers micro-financing and business training to small and micro-enterprises in Charlottesville and the surrounding counties",
      "startDate": "August 27",
      "eligibility": "Student Wage"
    },
    {
      "title": "Graduate Advising Fellow for Animals and Environmental Services - Federal Work Study Position (Graduate Student Wage)",
      "conciseDescription": "Student Financial Services in conjunction with Madison House, located at 170 Rigby Road Charlottesville Virginia 22903, is accepting applications for a Graduate Fellow position concentrating in the area of Animals and Environmental Services. Candidates must request and receive Federal Work Study in order to be eligible for consideration by the hiring manger. Madison House serves as the student volunteer center at the University of Virginia and coordinates community partners, student leaders, and volunteers to address the needs of the community as well as the educational and personal growth objectives of students.",
      "timePosted": "2024-07-23",
      "wage": "$17.00",
      "requirements": "Candidates must request and receive Federal Work Study in order to be eligible for consideration by the hiring manger",
      "responsibilities": "Madison House serves as the student volunteer center at the University of Virginia and coordinates community partners, student leaders, and volunteers to address the needs of the community as well as the educational and personal growth objectives of students",
      "startDate": "August 27, 2024",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Madison House Front Desk Receptionist - Federal Work-Study Position (Undergraduate Student Wage)",
      "conciseDescription": "In partnership with Student Financial Services and Madison House, recruitment is underway for a Front Desk Receptionist. Madison House is located at 170 Rugby Road Charlottesville, Virginia 22903. This job is offered as an in-person position only.",
      "timePosted": "2024-07-23",
      "wage": "$15.00",
      "requirements": "MINIMUM REQUIREMENTS Students must be eligible to receive and accept Federal Work Study",
      "responsibilities": "At Madison House, we coordinate volunteers, develop leaders, build community partnerships, and promote lifelong volunteer service",
      "startDate": "August 27, 2024",
      "eligibility": "Federal Work Study"
    }
  ],
  "South Lawn Nau Hall": [
    {
      "title": "EAP Program Instructional Assistant (IA) Summer 2025 (Student Wage)",
      "conciseDescription": "Do you want to work with international students this summer? Do you need a summer position to gain experience in a classroom setting? Become an Instructional Assistant with CAELC! The Center for American English Language and Culture (CAELC) is a pan-university unit charged with providing leadership on issues related to ESL/intercultural communication and helping members of the UVA community attain the level of linguistic and cultural proficiency needed for success at a research university in the United States. Each summer, CAELC runs the English for Academic Purposes (EAP) Program, an intensive language and culture four-week course designed for incoming international students at UVA. Through coursework, workshops, and engaging activities, the students acclimate to UVA’s academic environment and to life in Charlottesville prior to starting their graduate programs.",
      "timePosted": "2025-02-06",
      "wage": "$18.00",
      "requirements": "All IAs should have access to a computer, a reliable internet connection, and should feel comfortable with using Zoom, Google Suite, UVACanvas, and Office 365",
      "responsibilities": "Do you want to work with international students this summer? Do you need a summer position to gain experience in a classroom setting? Become an Instructional Assistant with CAELC! The Center for American English Language and Culture (CAELC) is a pan-university unit charged with providing leadership on issues related to ESL/intercultural communication and helping members of the UVA community attain the level of linguistic and cultural proficiency needed for success at a research university in the United States",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Student Health And Wellness Center": [
    {
      "title": "Graduate Assistant- Gordie Center Hazing Prevention Program Facilitator (Student Wage)",
      "conciseDescription": "Facilitate educational discussions following the Gordie Center's HAZE film with high school, college, and parent audiences. Co-facilitate Hoos Against Hazing sessions for potential new members of student organizations - must be available on Mondays and Thursdays, in Charlottesville, from June 30 - July 24 from 1:00 -5:30pm. Training will be provided.",
      "timePosted": "2025-02-04",
      "wage": "$15.00",
      "requirements": "Co-facilitate Hoos Against Hazing sessions for potential new members of student organizations - must be available on Mondays and Thursdays, in Charlottesville, from June 30 - July 24 from 1:00 -5:30pm",
      "responsibilities": "Not specified.",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "SHWC Event Assistant (Student Wage)",
      "conciseDescription": "Student Health & Wellness is a service-oriented unit responsible for housing various programs and services such as Medical Services, Pharmacy, Pharmacy Retail Space, SDAC, CAPS, OHP, Gordie Center, Laboratory, Radiology, Kinesiology, Multi-purpose rooms, Teaching Kitchen, Living Room, Student Lounge, Reflection Rooms, Art Therapy Room, Group Therapy Rooms, Wellness Suite, and Collegiate Recovery Program. The student staff ensures the proper use of Student Health & Wellness, the safety and well-being of patrons, compliance with facility use, general monitoring of the building and grounds and upholding policies and procedures. The Event Assistant performs various duties related to facility supervision, customer service and event management (including space set-ups, Audio and Visual technology set-up, Information Desk responsibilities and policy adherence) Responsibilities: Work as part of an event team to ensure proper event management and excellent customer service is rendered to all participants in Student Health & Wellness Perform facility and equipment setups for scheduled and unscheduled events and meetings.",
      "timePosted": "2025-01-03",
      "wage": "$12.41",
      "requirements": "Perform other tasks as required",
      "responsibilities": "The Event Assistant performs various duties related to facility supervision, customer service and event management (including space set-ups, Audio and Visual technology set-up, Information Desk responsibilities and policy adherence) Responsibilities: Work as part of an event team to ensure proper event management and excellent customer service is rendered to all participants in Student Health & Wellness Perform facility and equipment setups for scheduled and unscheduled events and meetings",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Assistant Student Staff-Art Room (Student Wage)",
      "conciseDescription": "This position offers an opportunity to gain experience in a wellness oriented art intervention program. The student will learn to work with staff overseeing the Art Room to maintain the space, assist with art/craft drop in hours and other scheduled programming, serve as a point person for students using the Art Room, develop and present class offerings to Art Room participants, and help develop media – to potentially include videos of craft making as step-by-step DIY guides. This position is open to current eligible UVA students.",
      "timePosted": "2024-12-20",
      "wage": "$14.00",
      "requirements": "Applicants must be available to work Tuesday and Thursday shifts",
      "responsibilities": "The student will learn to work with staff overseeing the Art Room to maintain the space, assist with art/craft drop in hours and other scheduled programming, serve as a point person for students using the Art Room, develop and present class offerings to Art Room participants, and help develop media – to potentially include videos of craft making as step-by-step DIY guides",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Graduate Accommodations Assistant (Student Wage)",
      "conciseDescription": "Wage position for 20 hours per week or less. Graduate Student Assistants for the Student Disability Access Center (SDAC) will provide generalist support focusing on accessible course materials and exam administration of accommodated academic exams to students with disabilities with approved exam-related accommodations. Duties will also include various aspects of office operations, such as front-line support for walk ins and appointments, scheduling and general office work, including answering emails and handling confidential records.",
      "timePosted": "2024-07-29",
      "wage": "$17",
      "requirements": "Qualifications: Candidates must adhere to strict confidentiality requirements of position",
      "responsibilities": "Graduate Student Assistants for the Student Disability Access Center (SDAC) will provide generalist support focusing on accessible course materials and exam administration of accommodated academic exams to students with disabilities with approved exam-related accommodations",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Minor Hall": [
    {
      "title": "Marketing and Outreach Intern (Student Wage)",
      "conciseDescription": "The Office of Summer & Special Academic Programs seeks an undergraduate or graduate student to serve as Marketing and Outreach Intern. The SSAP Office manages all domestic summer and January-term classes, as well as special programs such as the Summer Language Institute and the UVA Advance pre-college program. Position: Marketing and Outreach Intern Department: Office of Summer & Special Academic Programs Duration: Beginning in summer 2025 and continuing through the 2025-2026 Academic Year Duties and Responsibilities: Social Media: - Generate and schedule social media content using platforms such as Canva and Meta Business Suite Create visually appealing graphics and multimedia content Write engaging captions Maintain a consistent presence on social media channels, including engaging with other UVA accounts - Take pictures and create content during major events and in promotion of specific programming Marketing and Outreach: - Create original print and digital marketing materials, including posters, brochures, and digital ads - Ensure brand messaging is consistent and follows the UVA guidelines offered by BrandDot Virginia - Represent department at fairs, orientation, and other tabling events Data Analytics and Market Research: - Track social media engagement to identify high-performing ideas - Develop and test new strategies for increasing engagement - Stay up to date on the latest social media trends and platform changes - Follow other Higher Education Institutions' social media activities, particularly related to summer sessions, January terms, and similar special programs - Collect and analyze marketing activity data on a regular basis Qualifications: Understanding of social media and marketing trends Experience managing social media accounts Experience tracking and interpreting data related to user engagement and department programs Excellent written and oral communication skills and strong attention to detail Experience with or willingness to learn Canva and Meta Business Suite platforms Hours and Compensation: Hours: 10-20 hours per week, with some hours remote and some in person.",
      "timePosted": "2025-01-31",
      "wage": "$17.50",
      "requirements": "Not specified.",
      "responsibilities": "Position: Marketing and Outreach Intern Department: Office of Summer & Special Academic Programs Duration: Beginning in summer 2025 and continuing through the 2025-2026 Academic Year Duties and Responsibilities: Social Media: - Generate and schedule social media content using platforms such as Canva and Meta Business Suite Create visually appealing graphics and multimedia content Write engaging captions Maintain a consistent presence on social media channels, including engaging with other UVA accounts - Take pictures and create content during major events and in promotion of specific programming Marketing and Outreach: - Create original print and digital marketing materials, including posters, brochures, and digital ads - Ensure brand messaging is consistent and follows the UVA guidelines offered by BrandDot Virginia - Represent department at fairs, orientation, and other tabling events Data Analytics and Market Research: - Track social media engagement to identify high-performing ideas - Develop and test new strategies for increasing engagement - Stay up to date on the latest social media trends and platform changes - Follow other Higher Education Institutions' social media activities, particularly related to summer sessions, January terms, and similar special programs - Collect and analyze marketing activity data on a regular basis Qualifications: Understanding of social media and marketing trends Experience managing social media accounts Experience tracking and interpreting data related to user engagement and department programs Excellent written and oral communication skills and strong attention to detail Experience with or willingness to learn Canva and Meta Business Suite platforms Hours and Compensation: Hours: 10-20 hours per week, with some hours remote and some in person",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Summer Graduate Student Program Assistant (Student Wage)",
      "conciseDescription": "The Office of Summer and Special Academic Programs is seeking a Graduate Student to serve as the Program Assistant for the UVA Advance summer program. UVA Advance is a residential program for rising high school juniors and seniors. Hours: 20+ hours/week Start Date: June 24, 2024 End Date: August 10, 2024 Schedule: June 24-July 12: Hours generally fall within a standard 9-5, with some flexibility and possibility of partly remote work.",
      "timePosted": "2024-04-26",
      "wage": "$22.50",
      "requirements": "Two Saturday shifts, on July 13 and August 10, will be required",
      "responsibilities": "The Office of Summer and Special Academic Programs is seeking a Graduate Student to serve as the Program Assistant for the UVA Advance summer program",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Harrison Institute And Small Special Collections Library": [
    {
      "title": "Student Archives Assistant (Born Digital Backlog Project) (Student Wage)",
      "conciseDescription": "This job involves supporting the work of Archivists in the Albert and Shirley Small Special Collections Library. Duties will include locating and searching archival collections for born digital media carriers, working with spreadsheets in Excel, and searching databases to locate additional collections that might contain born digital media carriers. Work is primarily sedentary and performed in an office setting.",
      "timePosted": "2025-01-27",
      "wage": "$16.71",
      "requirements": "Required Qualifications: Ability to handle rare and special materials with care",
      "responsibilities": "This job involves supporting the work of Archivists in the Albert and Shirley Small Special Collections Library",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    }
  ],
  "New Cabell Hall": [
    {
      "title": "Course Assistant/Grader for “Ecological Economics: Economics as if People and the Laws of Thermodynamics Mattered” (GSGS 3330), Spring 2025 - Federal Work-Study (Student Wage)",
      "conciseDescription": "The Global Studies program seeks an energetic graduate student to assist with grading and student advising in this core course for students in the Environments + Sustainability, Global Development Studies, and Global Commerce & Culture in Society students. This is an excellent opportunity for graduate students from any discipline to broaden their subject matter knowledge. Students in policy-related disciplines (politics, foreign aff airs, leadership & public policy, economics, etc.) may find this experience particularly valuable to their career preparation.",
      "timePosted": "2025-01-14",
      "wage": "$20",
      "requirements": "While the course is not exceptionally “math-y”, students should expect to use (pre-calc) mathematical and quantitative reasoning, graphical/visual thinking, and, of course, strong rhetorical skills in approaching and evaluating problems and solutions",
      "responsibilities": "The Global Studies program seeks an energetic graduate student to assist with grading and student advising in this core course for students in the Environments + Sustainability, Global Development Studies, and Global Commerce & Culture in Society students",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Graduate Student Intern, Office of Diversity Programs (Student Wage)",
      "conciseDescription": "The University of Virginia Office of Graduate and Postdoctoral Affairs, Diversity Programs offers a collaborative, and engaging learning atmosphere in which to work. Our office mission is to cultivate a rich and inclusive and supportive learning environment, where the identities, perspectives, and views of all graduate students and postdoctoral scholars are affirmed to establish dignity and pride to thrive at the University of Virginia. To learn more about our office, please visit us at: http://graddiversity.virginia.edu/.",
      "timePosted": "2024-10-10",
      "wage": "$20",
      "requirements": "Special areas of assignment may include a mix of the following: Serving students from underrepresented and underserved populations Conducting benchmarking and research for diversity newsletters and website content Researching and managing diversity program resource materials Assisting with the activities, programs, and services affiliated with the UVA Mentoring Institute program Helping with outreach and engagement with Minority Serving Institutions Coordinate and execute undergraduate summer research program workshops Planning incoming graduate student orientation sessions Planning and executing the Diversity Programs Office annual diversity programs, such as the Diversity retreat, Celebration of Excellence, and the Doctoral Diversity Dinner Spearhead engagement with UVA student affinity groups and organizations Expectations & Outcomes In addition to the responsibilities outlined above, the Graduate Intern will be expected to: Current graduate student at the University of Virginia",
      "responsibilities": "Our office mission is to cultivate a rich and inclusive and supportive learning environment, where the identities, perspectives, and views of all graduate students and postdoctoral scholars are affirmed to establish dignity and pride to thrive at the University of Virginia",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Drama Education Building": [
    {
      "title": "Student Stage Hands/Board Ops, Spring 2025 Semester (Student Wage)",
      "conciseDescription": "The Department of Drama is seeking current UVA students to work as Stage Hands/Board Operators. These positions perform the following duties: Operating sound and lighting equipment during technical rehearsals and performances Maintaining stage equipment, sets, props, and costumes Working with the stage manager and other crew members to ensure the smooth running of the performance Coordinating with other technical personnel to manage scene changes during performances Ensuring safety standards are met during all operations on and around the stage Executing quick and efficient set changes during live performances Perform duties as required or requested In addition to the above job responsibilities, other duties may be assigned. Requirements: Availability during the evening Wear all black from the neck down Communicate over a headset and via email Anticipated assignment dates: Spring 2025 Semester Position Compensation: $12.41 Hourly.",
      "timePosted": "2025-01-07",
      "wage": "$12.41",
      "requirements": "These positions perform the following duties: Operating sound and lighting equipment during technical rehearsals and performances Maintaining stage equipment, sets, props, and costumes Working with the stage manager and other crew members to ensure the smooth running of the performance Coordinating with other technical personnel to manage scene changes during performances Ensuring safety standards are met during all operations on and around the stage Executing quick and efficient set changes during live performances Perform duties as required or requested In addition to the above job responsibilities, other duties may be assigned",
      "responsibilities": "These positions perform the following duties: Operating sound and lighting equipment during technical rehearsals and performances Maintaining stage equipment, sets, props, and costumes Working with the stage manager and other crew members to ensure the smooth running of the performance Coordinating with other technical personnel to manage scene changes during performances Ensuring safety standards are met during all operations on and around the stage Executing quick and efficient set changes during live performances Perform duties as required or requested In addition to the above job responsibilities, other duties may be assigned",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Student Scene Shop Assistant (Student Wage)",
      "conciseDescription": "The Department of Drama seeks a Student Scene Shop Assistant. This is an academic year position that requires students with some carpentry skills to work in the scene shop 1-2 days/week. Perform duties as required or requested including props shop help Assisting with scenic builds Assisting with theatre resets (drapery, set pieces, stage) Position Compensation: $12.41 Hourly MINIMUM REQUIREMENTS Education: Currently enrolled UVA student Experience: At least 3 months doing carpentry/engineering or set building Licensure: None PHYSICAL DEMANDS This is primarily a non-sedentary job involving extensive use of tools, woodworking, hand scenic hanging The University of Virginia, including the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff.",
      "timePosted": "2025-01-03",
      "wage": "$12.41",
      "requirements": "Perform duties as required or requested including props shop help Assisting with scenic builds Assisting with theatre resets (drapery, set pieces, stage) Position Compensation: $12.41 Hourly MINIMUM REQUIREMENTS Education: Currently enrolled UVA student Experience: At least 3 months doing carpentry/engineering or set building Licensure: None PHYSICAL DEMANDS This is primarily a non-sedentary job involving extensive use of tools, woodworking, hand scenic hanging The University of Virginia, including the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff",
      "responsibilities": "The Department of Drama seeks a Student Scene Shop Assistant",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Chemistry Building": [
    {
      "title": "CHEM - Harman FWS Undergraduate Student (Student Wage) Federal Work Study",
      "conciseDescription": "The Chemistry Department is looking for Federal Work Study undergraduate teaching assistants for the Fall 2024 and Spring 2025 semesters. To apply, please submit a resume with your application in Workday. Applicants must be a Federal Work Study award recipient.",
      "timePosted": "2025-01-03",
      "wage": "$12.41",
      "requirements": "Applicants must be a Federal Work Study award recipient",
      "responsibilities": "The Chemistry Department is looking for Federal Work Study undergraduate teaching assistants for the Fall 2024 and Spring 2025 semesters",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "CHEM - Morkowchuk FWS Undergraduate Student (Student Wage) Federal Work Study",
      "conciseDescription": "The Chemistry Department is looking for Federal Work Study undergraduate teaching assistants for the Fall 2024 and Spring 2025 semesters. To apply, please submit a resume with your application in Workday. Applicants must be a Federal Work Study award recipient.",
      "timePosted": "2025-01-03",
      "wage": "$12.41",
      "requirements": "Applicants must be a Federal Work Study award recipient",
      "responsibilities": "The Chemistry Department is looking for Federal Work Study undergraduate teaching assistants for the Fall 2024 and Spring 2025 semesters",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "CHEM - Welch FWS Undergraduate Student (Student Wage) Federal Work Study",
      "conciseDescription": "The Chemistry Department is looking for Federal Work Study undergraduate teaching assistants for the Fall 2024 and Spring 2025 semesters. To apply, please submit a resume with your application in Workday. Must be a Federal Work Study award recipient.",
      "timePosted": "2025-01-03",
      "wage": "$12.41",
      "requirements": "Must be a Federal Work Study award recipient",
      "responsibilities": "The Chemistry Department is looking for Federal Work Study undergraduate teaching assistants for the Fall 2024 and Spring 2025 semesters",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "CHEM - Chruma FWS Undergraduate Student (Student Wage) Federal Work Study",
      "conciseDescription": "The Chemistry Department is looking for Federal Work Study undergraduate teaching assistants for the Fall 2024 and Spring 2025 semesters. To apply, please submit a resume with your application in Workday. Applicants must be a Federal Work Study award recipient.",
      "timePosted": "2025-01-03",
      "wage": "$12.41",
      "requirements": "Applicants must be a Federal Work Study award recipient",
      "responsibilities": "The Chemistry Department is looking for Federal Work Study undergraduate teaching assistants for the Fall 2024 and Spring 2025 semesters",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "CHEM - Frantz FWS Undergraduate Student (Student Wage) Federal Work Study",
      "conciseDescription": "The Chemistry Department is looking for Federal Work Study undergraduate teaching assistants for the Fall 2024 and Spring 2025 semesters. To apply, please submit a resume with your application in Workday. Applicants must be a Federal Work Study award recipient.",
      "timePosted": "2025-01-03",
      "wage": "$12.41",
      "requirements": "Applicants must be a Federal Work Study award recipient",
      "responsibilities": "The Chemistry Department is looking for Federal Work Study undergraduate teaching assistants for the Fall 2024 and Spring 2025 semesters",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    }
  ],
  "Halsey Hall": [
    {
      "title": "STAT - Lab Assistant - FWS Student (Student Wage)",
      "conciseDescription": "The Statistics Department is seeking Federal Work Study Lab Assistants for STAT 2120. Lab assistants will attend the entirety of their assigned STAT 2120 lab sections. As students complete group assignments and activities during the lab sections, the role of the lab assistant is to check in with the student groups to answer questions, engage in discussions about the course material, or any other tasks as instructed by the professor or graduate teaching assistant.",
      "timePosted": "2025-01-03",
      "wage": "$12.41",
      "requirements": "MINIMUM REQUIREMENTS Education: Current UVA student Federal Work Study is required",
      "responsibilities": "The Statistics Department is seeking Federal Work Study Lab Assistants for STAT 2120",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    }
  ],
  "John Paul Jones Arena": [
    {
      "title": "Content Tutor (Staff Wage & Student Wage)",
      "conciseDescription": "UVA Athletics Academic Affairs seeks a diverse candidate pool of Content Tutors to assist student-athletes with course specific knowledge and skill acquisition including, but not limited to, test/quiz preparation, decoding of lecture content, and managing reading loads. We will hire across all discipline areas and qualified applicants will become a member of the Cavalier Academic Support Team (CAST). Content Tutors meet with their assigned student(s) on a regular schedule (typically twice weekly) and will work in small groups or one-on-one with student-athletes.",
      "timePosted": "2024-12-16",
      "wage": "$20-$22",
      "requirements": "Content Tutors are expected to have a strong understanding of the course content and demonstrate this through the incorporation of relevant study strategies in proper planning of the sessions",
      "responsibilities": "UVA Athletics Academic Affairs seeks a diverse candidate pool of Content Tutors to assist student-athletes with course specific knowledge and skill acquisition including, but not limited to, test/quiz preparation, decoding of lecture content, and managing reading loads",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Class Checker (Student Wage)",
      "conciseDescription": "The Department of Athletics, Academic Affairs is hiring part-time Class Checkers. The role of a Class Checker is to monitor and record class attendance of student-athletes. Class Checkers will receive a schedule of classes for which to check attendance of designated student-athletes.",
      "timePosted": "2024-08-13",
      "wage": "$15.00",
      "requirements": "Class Checkers must have reliable transportation to UVA",
      "responsibilities": "Not specified.",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Astronomy Building": [
    {
      "title": "Office and Public Outreach Administrative Assistant (Student Wage)",
      "conciseDescription": "The Department of Astronomy is seeking applications for a part-time Office and Public Outreach Assistant to assist with “Dark Skies, Bright Kids” semester clubs. Office assistant work will be performed in a typical office setting, with the use of general office machines (computer, fax, copier, email, etc). Public outreach program work will be performed at local elementary schools with transportation provided by the department.",
      "timePosted": "2024-12-10",
      "wage": "$14.00",
      "requirements": "Previous experience working in elementary schools or with elementary age children is preferred, but not required",
      "responsibilities": "The Department of Astronomy is seeking applications for a part-time Office and Public Outreach Assistant to assist with “Dark Skies, Bright Kids” semester clubs",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    }
  ],
  "Wilson Hall": [
    {
      "title": "Learning Design Intern (Graduate Student Wage - FWS Possible)",
      "conciseDescription": "The College and Graduate School of Arts & Sciences Learning Design and Technology (LDT) is hiring a Learning Design Intern for Spring 2025. Learn more about A&S LDT. This role is an excellent opportunity to explore instructional design in a higher education context and to contribute to the teaching and learning mission of the College of Arts & Sciences.",
      "timePosted": "2024-12-05",
      "wage": "$24",
      "requirements": "Not specified.",
      "responsibilities": "Responsibilities may include: Support LDT professional learning programs (e.g",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Town Center Four": [
    {
      "title": "Communications Intern (Student Wage)",
      "conciseDescription": "The Biocomplexity Institute is looking for a motivated and enthusiastic Communications Intern to help share the groundbreaking research and impactful work of our institute. As part of our dynamic team, you'll play a key role in managing existing communication channels and bringing our stories to life. Your responsibilities will include: Writing and editing compelling press releases and news articles Assisting with web page creation and website updates Editing engaging video content Supporting event organization and promotion Tackling a variety of exciting projects in a fast-paced environment What We're Looking For We welcome applicants who are: Current full-time UVA undergraduates (all majors are encouraged to apply, though preference will be given to Communications, English, Marketing, or similar disciplines) Experienced in web-based projects Strong writers and communicators, with excellent verbal and written skills Bonus Skills (Nice to Have but Not Required): Familiarity with Drupal-based websites Experience using creative tools like Photoshop, Canva, or other media platforms Experience with Facebook, Instagram, LinkedIn or other social media channels Experience with Hootsuite or other social media management tools This is a fantastic opportunity to build your portfolio, gain hands-on experience, and contribute to meaningful projects.",
      "timePosted": "2024-12-03",
      "wage": "$15.00",
      "requirements": "Your responsibilities will include: Writing and editing compelling press releases and news articles Assisting with web page creation and website updates Editing engaging video content Supporting event organization and promotion Tackling a variety of exciting projects in a fast-paced environment What We're Looking For We welcome applicants who are: Current full-time UVA undergraduates (all majors are encouraged to apply, though preference will be given to Communications, English, Marketing, or similar disciplines) Experienced in web-based projects Strong writers and communicators, with excellent verbal and written skills Bonus Skills (Nice to Have but Not Required): Familiarity with Drupal-based websites Experience using creative tools like Photoshop, Canva, or other media platforms Experience with Facebook, Instagram, LinkedIn or other social media channels Experience with Hootsuite or other social media management tools This is a fantastic opportunity to build your portfolio, gain hands-on experience, and contribute to meaningful projects",
      "responsibilities": "Your responsibilities will include: Writing and editing compelling press releases and news articles Assisting with web page creation and website updates Editing engaging video content Supporting event organization and promotion Tackling a variety of exciting projects in a fast-paced environment What We're Looking For We welcome applicants who are: Current full-time UVA undergraduates (all majors are encouraged to apply, though preference will be given to Communications, English, Marketing, or similar disciplines) Experienced in web-based projects Strong writers and communicators, with excellent verbal and written skills Bonus Skills (Nice to Have but Not Required): Familiarity with Drupal-based websites Experience using creative tools like Photoshop, Canva, or other media platforms Experience with Facebook, Instagram, LinkedIn or other social media channels Experience with Hootsuite or other social media management tools This is a fantastic opportunity to build your portfolio, gain hands-on experience, and contribute to meaningful projects",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Michie North": [
    {
      "title": "Research Computing Student Worker (Student Wage)",
      "conciseDescription": "UVA Research Computing (RC) within Information Technology Services (ITS) is seeking student workers. Our team strives to create innovative computational and data analysis solutions for researchers. We build and maintain the University's high performance computing platforms while educating the next generation of researchers on the power of advanced computing.",
      "timePosted": "2024-11-04",
      "wage": "$16 - $18",
      "requirements": "Not specified.",
      "responsibilities": "We build and maintain the University's high performance computing platforms while educating the next generation of researchers on the power of advanced computing",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Parking & Transit": [
    {
      "title": "Flexible Work Schedule - Transit Bus Driver (Student Wage)",
      "conciseDescription": "University Transit Service (UTS) is seeking students to become transit bus drivers. The driver will work within UTS to provide transportation services to the University of Virginia community. Duties include operation of a transit unit on a fixed route as well as transit operation in support of University-wide events.",
      "timePosted": "2024-10-29",
      "wage": "$23.25",
      "requirements": "An interest in transportation, urban planning, or sustainability is a plus but not required",
      "responsibilities": "Duties include operation of a transit unit on a fixed route as well as transit operation in support of University-wide events",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "UTS OnDemand Driver (Student Wage)",
      "conciseDescription": "UTS OnDemand drivers work within the Department of Parking and Transportation to provide overnight transportation service to the University community. They operate vans and other fleet vehicles on an overnight rideshare service that operates between fixed pickup and drop-off points. The schedule for this position will involve working weekday and weekend nights into early mornings.",
      "timePosted": "2024-06-13",
      "wage": "$19.00",
      "requirements": "A pre-employment drug screening is required",
      "responsibilities": "Not specified.",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Old Cabell Hall": [
    {
      "title": "Promotion's Assistant (Student Wage)",
      "conciseDescription": "The UVA Department of Music seeks a part-time promotions assistant to help with press releases, public service, and calendar announcements, general office duties, and assist with web and social media updates as needed. The ideal candidate has a professional and courteous demeanor, is reliable, detail oriented and preferably able to proofread and edit. Additionally, the promotions assistant must be able to work well with others as well as independently on a variety of projects ranging from simple to moderate in complexity.",
      "timePosted": "2024-10-28",
      "wage": "$13.00",
      "requirements": "Additionally, the promotions assistant must be able to work well with others as well as independently on a variety of projects ranging from simple to moderate in complexity",
      "responsibilities": "The UVA Department of Music seeks a part-time promotions assistant to help with press releases, public service, and calendar announcements, general office duties, and assist with web and social media updates as needed",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Dell Building #1": [
    {
      "title": "Student Research Assistant (Job Market Analysis) (Student Wage)",
      "conciseDescription": "The Data Science School is seeking to hire two Research Assistants focused on analyzing the Data Science job market. Students should have experience with Python and be interested in various methods for data gathering (web-scraping, API access, etc.) and presenting data. Experience building websites is helpful, but not necessary.",
      "timePosted": "2024-10-15",
      "wage": "$15.00",
      "requirements": "Students should have experience with Python and be interested in various methods for data gathering (web-scraping, API access, etc.) and presenting data",
      "responsibilities": "The Data Science School is seeking to hire two Research Assistants focused on analyzing the Data Science job market",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "School Of Data Science": [
    {
      "title": "SQL Tutor/Instructor (Part-Time, In-Person) (Student Wage)",
      "conciseDescription": "The School of Data Science at UVA is looking for an experienced SQL tutor/instructor to help students in data science learn core concepts in SQL. The primary audience are students in our Residential master’s in data science program. It is possible for this position to be a Federal Work Study position for those eligible.",
      "timePosted": "2024-10-08",
      "wage": "$15-$25",
      "requirements": "Not specified.",
      "responsibilities": "Not specified.",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    }
  ],
  "Gilmer Hall": [
    {
      "title": "BIOL - Deppmann Lab Web Developer Federal Work Study (Student Wage)",
      "conciseDescription": "No experience or previous training required. Perform routine tasks with minimal responsibility. Where applicable, position may require ability to interact with the general public.",
      "timePosted": "2024-10-08",
      "wage": "$15.00",
      "requirements": "No experience or previous training required",
      "responsibilities": "The Deppmann Lab at the University of Virginia is seeking a motivated and creative work-study student to assist in rebuilding our lab website and developing a biochemistry-focused site for the broader community",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "BIOL - Parichy Lab (Student Wage) Federal Work Study",
      "conciseDescription": "The Parichy lab (parichylab.org) is looking for part time assistants to help with routine tasks in both molecular biology and animal facilities, including solution preparation, plate pouring, sterilization, organization and inventory, and care and feeding of tropical fish (zebrafish and related species) using for developmental genetic and evolutionary studies. Though an entry level position, opportunities are also available for professional skills development and assisting with on-going research projects that include mutant screens, gene perturbation by CRISPR methods, PCR and molecular cloning, and other activities. Hours are flexible around course schedules.",
      "timePosted": "2024-07-30",
      "wage": "$14.60",
      "requirements": "Not specified.",
      "responsibilities": "The Parichy lab (parichylab.org) is looking for part time assistants to help with routine tasks in both molecular biology and animal facilities, including solution preparation, plate pouring, sterilization, organization and inventory, and care and feeding of tropical fish (zebrafish and related species) using for developmental genetic and evolutionary studies",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "FWS Student - BIOL - Greenhouse Assistant (Student Wage) - Federal Work Study Position",
      "conciseDescription": "The Greenhouse Assistant will assist in all aspects of the UVA Biology Department research greenhouse operations. Maintain a clean user space in and around the greenhouse and head house. Sanitize potting containers and various greenhouse equipment Maintain records and reports as required Qualifications: Must be a UVA student and eligible for federal work-study.",
      "timePosted": "2024-07-10",
      "wage": "$12.00",
      "requirements": "Sanitize potting containers and various greenhouse equipment Maintain records and reports as required Qualifications: Must be a UVA student and eligible for federal work-study",
      "responsibilities": "The Greenhouse Assistant will assist in all aspects of the UVA Biology Department research greenhouse operations",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "FWS-BIOL-Parichy Lab Student Research Assistant",
      "conciseDescription": "The Parichy lab (parichylab.org) is looking for part time assistants to help with routine tasks in both molecular biology and animal facilities, including solution preparation, plate pouring, sterilization, organization and inventory, and care and feeding of tropical fish (zebrafish and related species) using for developmental genetic and evolutionary studies. Though an entry level position, opportunities are also available for professional skills development and assisting with on-going research projects that include mutant screens, gene perturbation by CRISPR methods, PCR and molecular cloning, and other activities. Hours are flexible around course schedules.",
      "timePosted": "2023-08-30",
      "wage": "$14.60",
      "requirements": "Must be reliable and have excellent attention to detail as well as some prior work experience (retail, restaurant, construction, military, or other); prior lab experience is not required",
      "responsibilities": "The Parichy lab (parichylab.org) is looking for part time assistants to help with routine tasks in both molecular biology and animal facilities, including solution preparation, plate pouring, sterilization, organization and inventory, and care and feeding of tropical fish (zebrafish and related species) using for developmental genetic and evolutionary studies",
      "startDate": "Not specified.",
      "eligibility": "Not specified."
    }
  ],
  "Thornton Hall": [
    {
      "title": "Student Intern, Center for Transportation Studies (Student Wage)",
      "conciseDescription": "The CTS student intern will support the Civil and Environmental Engineering's Center for Transportation Studies by managing and updating various digital platforms. This role is ideal for a student with a strong interest in website administration, social media management, and digital marketing. Key Responsibilities: · Update and maintain the Center’s website and weekly blog (WordPress).",
      "timePosted": "2024-10-07",
      "wage": "N/A",
      "requirements": "Not specified.",
      "responsibilities": "The CTS student intern will support the Civil and Environmental Engineering's Center for Transportation Studies by managing and updating various digital platforms",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Randolph Building": [
    {
      "title": "Federal Work Study Research Assistant (Student Wage)",
      "conciseDescription": "Exploring characteristics of children’s extraordinary memories The Division of Perceptual Studies (DOPS) at UVA’s School of Medicine (SOM) is seeking a graduate Federal Work-Study student to assist Drs. Marieta Pehlivanova and Philip Cozzolino a research project about children’s purported past-life memories. This is a part-time work-study position (10-20 hours/week), in-person role located in the Division’s downtown Charlottesville office.",
      "timePosted": "2024-10-02",
      "wage": "$19.61-26.00",
      "requirements": "The Research Assistant will provide critical support for this established body of work, with position responsibilities including: Participating in necessary training to become familiar with areas of study pursued at DOPS and related research protocols Assisting in maintaining SPSS database, clean database for processing Assisting in qualitative coding of narratives Assisting in creating online surveys Passing the UVA Institutional Review Boards SBS and HSR CITI training in research ethics Successful candidates should understand and be able to apply basic research principles, concepts, practices, and methods",
      "responsibilities": "Exploring characteristics of children’s extraordinary memories The Division of Perceptual Studies (DOPS) at UVA’s School of Medicine (SOM) is seeking a graduate Federal Work-Study student to assist Drs",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Research Assistant (Undergraduate Student Wage)",
      "conciseDescription": "********Federal Work Study Students ONLY********* The Division of Perceptual Studies (DOPS) at UVA’s School of Medicine (SOM) is seeking an undergraduate Federal Work-Study student to assist Dr. Marieta Pehlivanova with a research project about the characteristics and impacts of near-death experiences. These are subjective experiences that some individuals have when they are close to death or in a medical crisis and they can profoundly transform their lives.",
      "timePosted": "2024-09-30",
      "wage": "N/A",
      "requirements": "The Research Assistant will provide critical support for this established body of work, with responsibilities including: · Participating in necessary training to become familiar with research on near-death experiences and current research protocols · Assisting in qualitative coding of narratives · Assisting in creating online surveys · Passing the UVA Institutional Review Board for the Social and Behavioral Sciences CITI training in research ethics Successful candidates should understand and be able to apply basic research principles and concepts",
      "responsibilities": "********Federal Work Study Students ONLY********* The Division of Perceptual Studies (DOPS) at UVA’s School of Medicine (SOM) is seeking an undergraduate Federal Work-Study student to assist Dr",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "DOPS Graduate Research Assistant OBE 1– Federal Work Study – Remote Optional/Possible",
      "conciseDescription": "Provides specialized service or instruction that requires certification or demonstrated mastery of advanced skills. Performs advanced or specialized administrative support functions or services at the highest paraprofessional level that require significant training, skill, or experience. Compiling, classifying, evaluating, and reporting materials along with a wide range of other duties.",
      "timePosted": "2024-09-18",
      "wage": "$16.75-26.15",
      "requirements": "Direct or moderate supervision is provided; independent judgment and decision-making skills required",
      "responsibilities": "Performs advanced or specialized administrative support functions or services at the highest paraprofessional level that require significant training, skill, or experience",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Research Assistant (Graduate Student Wage)",
      "conciseDescription": "Graduate Assistant - Advanced: Performs advanced instruction, functions or services at the highest paraprofessional level that require significant training, skill, or experience. Compiling, evaluating, reporting, accounting and other business processes. Direct or moderate supervision is provided; independent judgment and decision-making skills required.",
      "timePosted": "2024-09-13",
      "wage": "N/A",
      "requirements": "Direct or moderate supervision is provided; independent judgment and decision-making skills required",
      "responsibilities": "Graduate Assistant - Advanced: Performs advanced instruction, functions or services at the highest paraprofessional level that require significant training, skill, or experience",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Research Assistant (Graduate Student Wage)",
      "conciseDescription": "The Division of Perceptual Studies (DOPS) at UVA’s School of Medicine (SOM) is seeking a graduate Federal Work-Study student to assist Drs. Marieta Pehlivanova and Philip Cozzolino a research project about children’s purported past-life memories. This is a part-time work-study position (10-20 hours/week), in-person role located in the Division’s downtown Charlottesville office.",
      "timePosted": "2024-09-11",
      "wage": "N/A",
      "requirements": "The Research Assistant will provide critical support for this established body of work, with position responsibilities including: Participating in necessary training to become familiar with areas of study pursued at DOPS and related research protocols Assisting in maintaining SPSS database, clean database for processing Assisting in basic data analysis Assisting in qualitative coding of narratives Assisting in creating online surveys Passing the UVA Institutional Review Boards SBS and HSR CITI training in research ethics Successful candidates should understand and be able to apply research principles, concepts, practices, and methods",
      "responsibilities": "The Division of Perceptual Studies (DOPS) at UVA’s School of Medicine (SOM) is seeking a graduate Federal Work-Study student to assist Drs",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    }
  ],
  "Brooks Hall": [
    {
      "title": "Anthropology Department Work Study - Fall 2024 and Spring 2025 (Student Wage)",
      "conciseDescription": "The UVA Department of Anthropology is looking for a Work-Study student to assist faculty and staff with daily office functions such as (a) copying and scanning of paper materials and handling mail; (b) events space organization and technological support at Brooks Hall; and (c) organization of archaeology labs, closets and other spaces at Brooks. Although there is flexibility during the week, the work study student must be available Friday afternoons (from 12:00 to 4:30 pm) to assist with arranging Brooks Hall space for weekly Department speaker series. This includes setting up and taking down seating and setting up AV system for the event (must be willing to become familiar with the relevant technology), and organizing reception space for food set-up, delivery and removal.",
      "timePosted": "2024-09-17",
      "wage": "$14.53",
      "requirements": "Although there is flexibility during the week, the work study student must be available Friday afternoons (from 12:00 to 4:30 pm) to assist with arranging Brooks Hall space for weekly Department speaker series",
      "responsibilities": "The UVA Department of Anthropology is looking for a Work-Study student to assist faculty and staff with daily office functions such as (a) copying and scanning of paper materials and handling mail; (b) events space organization and technological support at Brooks Hall; and (c) organization of archaeology labs, closets and other spaces at Brooks",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Course Assistant/Grader for GSGS 2000: Intro to Global Studies (Fall 2024) (Student Wage)",
      "conciseDescription": "The Global Studies program seeks an energetic graduate or undergraduate student to assist with grading and student advising in this introduction course for Global Studies. This interdisciplinary course introduces students to critical global economic and cultural issues and examines globalization at a variety of scales of analysis (planetary, regional, national, individual). The goal is to provide understanding of the main conceptual approaches to global studies and thus enhance their ability to understand and evaluate important real-world issues and problems, and to introduce students to the tracks of the Global Studies program (Environments and Sustainability, Development, Public Health, Security and Justice, and Culture and Commerce).",
      "timePosted": "2024-08-06",
      "wage": "$20",
      "requirements": "Not specified.",
      "responsibilities": "The Global Studies program seeks an energetic graduate or undergraduate student to assist with grading and student advising in this introduction course for Global Studies",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Garrett Hall": [
    {
      "title": "Research Assistant for Public Policy and Economics (Student Wage) Federal Work Study",
      "conciseDescription": "The Research Assistant for Public Policy and Economics will be responsible for: assisting with data collection, basic descriptive data analysis, and other tasks related to the preparation of reports assisting with presentation materials and providing periodic briefings to the research team conducting a thorough literature review and data collection from various open sources In addition to the above job responsibilities, other duties may be assigned. No experience or previous training required. Where applicable, position may require ability to interact with the general public.",
      "timePosted": "2024-09-16",
      "wage": "$14.00",
      "requirements": "No experience or previous training required",
      "responsibilities": "The Research Assistant for Public Policy and Economics will be responsible for: assisting with data collection, basic descriptive data analysis, and other tasks related to the preparation of reports assisting with presentation materials and providing periodic briefings to the research team conducting a thorough literature review and data collection from various open sources In addition to the above job responsibilities, other duties may be assigned",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    }
  ],
  "Fayerweather Hall": [
    {
      "title": "Printshop Assistant, Art Department (Student Wage)",
      "conciseDescription": "The UVA Department of Art Printmaking Lab seeks a qualified student to fill a temporary position within the Studio art building as a Printshop Student Assistant. The printshop student assistant is required to have a basic understanding of hand tools, in addition to one year of art making experience. The successful candidate must be able to perform basic art lab tasks, have attention to details, and demonstrate an ability to work independently and show initiative and problem-solving skills.",
      "timePosted": "2024-09-13",
      "wage": "$15.00",
      "requirements": "The printshop student assistant is required to have a basic understanding of hand tools, in addition to one year of art making experience",
      "responsibilities": "The UVA Department of Art Printmaking Lab seeks a qualified student to fill a temporary position within the Studio art building as a Printshop Student Assistant",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Physics/Jesse Beams Laboratory": [
    {
      "title": "PHYS - FWS Undergraduate Student UTA (Student Wage)",
      "conciseDescription": "The Department of Physics is looking to hire Federal Work Study Undergraduate Students to work as Undergraduate Teaching Assistants for the 2024-2025 school year. The undergraduate teaching assistant in the lab (UTA) will be participating in the weekly training sessions, and is responsible for conducting the introductory labs for 2 sections per week (26 students in each) and holding office hours. During the training they develop skills and knowledge necessary to teach the lab the following week, and during the sections and office hours they are helping students to arrive at correct solutions to given problems, helping students to design their own experiment, collect the data, and perform the data analysis.",
      "timePosted": "2024-09-10",
      "wage": "$15.00",
      "requirements": "Questions should be directed to Maxim Bychkov at mab3ed@virginia.edu",
      "responsibilities": "The Department of Physics is looking to hire Federal Work Study Undergraduate Students to work as Undergraduate Teaching Assistants for the 2024-2025 school year",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    }
  ],
  "Carruthers Hall": [
    {
      "title": "Knowledge Content Creator (Federal Work Study Undergraduate Wage)",
      "conciseDescription": "Student Financial Services, a department within the Enrollment division, seeks qualified candidates to apply for the federal Work Study Position of Knowledge Content Creator. Student Financial Services is located in Carruthers Hall, 1001 North Emmett Street Charlottesville, Virginia 22903. Student Financial Services (SFS) is seeking organized and dedicated applicants to support the Shared Contact Center in writing and developing reference and training material.",
      "timePosted": "2024-09-04",
      "wage": "$15.00",
      "requirements": "Must adhere to strict confidentiality requirements of position",
      "responsibilities": "Student Financial Services (SFS) is seeking organized and dedicated applicants to support the Shared Contact Center in writing and developing reference and training material",
      "startDate": "May 9, 2025",
      "eligibility": "Federal Work Study"
    },
    {
      "title": "Document Processor (Undergraduate Student Wage) Federal Work Study",
      "conciseDescription": "Student Financial Services, a department within UVA, is currently recruiting for an Undergraduate Federal Work Study Document Processor position. This position will be located in Carruthers Hall, located at 1001 N. Emmett Street in Charlottesville, Virginia.",
      "timePosted": "2024-07-25",
      "wage": "$15.00",
      "requirements": "Qualifications: Excel Word Outlook ImageNow Good Attitude Highly organized Time management Confidentiality a MUST Hourly rate: $15.00 per hour",
      "responsibilities": "Not specified.",
      "startDate": "August 27, 2024",
      "eligibility": "Federal Work Study"
    }
  ],
  "Pinn Hall": [
    {
      "title": "Cancer Center CORES Undergraduate Federal Work Study (Student Wage)",
      "conciseDescription": "The Cancer Center seeks federal work-study students to work in its multiple labs and research areas. Students must have excellent communication and organizational skills, proactive, and a willingness to learn and a demonstrated interest in science, biomedical research or a related field. We seek work-study eligible students to work in the following Core units: Biomolecular Analysis Facility Bioinformatics Core UVA Flow Cytometry Core Facility Duties may include or be limited to within one or more of the three labs: lab safety training; basic lab techniques (i.e.",
      "timePosted": "2024-08-26",
      "wage": "N/A",
      "requirements": "Students must have excellent communication and organizational skills, proactive, and a willingness to learn and a demonstrated interest in science, biomedical research or a related field",
      "responsibilities": "Not specified.",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    }
  ],
  "Olsson Hall": [
    {
      "title": "Administrative/Research Assistant, Systems and Information Engineering (Student Wage)",
      "conciseDescription": "The School of Engineering and Applied Sciences, Department of Systems and Information Engineering, seeks applicants for 1-2 part-time Administrative/Research Assistants for the 2024/25 school year. This position will be part time will perform administrative tasks and research assistance for a faculty member. Responsibilities and Duties: Assist with administrative tasks (i.e.",
      "timePosted": "2024-08-08",
      "wage": "$13.50",
      "requirements": "Literature reviews, transcriptions, etc.) Pushing wheelchair Driving to meetings Other duties as needed Qualifications: Must have computer skills (Microsoft Suite, online portals, etc.) Typing Speed of at least 65 WPM Strong writing, reading, and organization skills Enrolled full-time (enrolled at least 12 hours per term) Must have a valid Driver's License and a good driving record A DMV driving record check will be required",
      "responsibilities": "The School of Engineering and Applied Sciences, Department of Systems and Information Engineering, seeks applicants for 1-2 part-time Administrative/Research Assistants for the 2024/25 school year",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Corner Building": [
    {
      "title": "Casscells Fellow (Graduate Student)",
      "conciseDescription": "The Maxine Platzer Lynn Women’s Center is seeking an outstanding graduate student who is devoted to both intellectual and practical ways of furthering leadership development. The graduate student hired for this position will work directly with the Assistant Director for Engaged Scholarship and the Education and Outreach Manager’s Gender Equity team. Responsibilities / Expectations / Outcomes In this newly reorganized role: Provides classroom support (not a teaching assistant) for the internship program’s course, Front Lines of Social Change and working with undergraduate interns and paid student works to execute Women’s Center programming.",
      "timePosted": "2024-07-31",
      "wage": "N/A",
      "requirements": "MINIMUM REQUIREMENTS Current graduate student Ability to plan and lead student groups Computer Applications: Proficiency with the Microsoft Office Suite, especially Word, Excel and -Outlook and the ability to enter data into a database; knowledge of MailChimp, Slack, cloud storage, Google Drive and other platforms is a plus, but not required",
      "responsibilities": "The Maxine Platzer Lynn Women’s Center is seeking an outstanding graduate student who is devoted to both intellectual and practical ways of furthering leadership development",
      "startDate": "Not specified.",
      "eligibility": "Graduate Student"
    },
    {
      "title": "YWLP Mentoring Coordinator (Student Wage)",
      "conciseDescription": "The YWLP Mentoring Coordinator will coordinate the operational activities of the Young Women Leaders Program (YWLP). Tasks include recruiting and matching UVA mentors and middle school students, scheduling mentoring group meetings, providing match support, assisting with the associated courses, basic level event planning, and completing administrative tasks. To accomplish these tasks, the Interim YWLP Mentoring Coordinator will work with both Women's Center and UVA’s School of Education and Human Development faculty, staff, and students.",
      "timePosted": "2024-07-31",
      "wage": "N/A",
      "requirements": "Some maintenance of existing partnerships with individual schools and the Charlottesville-Albemarle public educational community is expected",
      "responsibilities": "The YWLP Mentoring Coordinator will coordinate the operational activities of the Young Women Leaders Program (YWLP)",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Frank C. McCue III Ctr": [
    {
      "title": "Football Water Crew (Student Wage)",
      "conciseDescription": "University of Virginia Sports Medicine seeks responsible, motivated, and organized undergraduate students to assist in player hydration on the field during football practices. Professionalism, strong work ethic, punctuality, and enthusiasm are essential. Preferably enjoy the outdoors and the sport of football.",
      "timePosted": "2024-07-23",
      "wage": "$13.50",
      "requirements": "Requirements and Qualifications: Must be a current undergraduate UVA student",
      "responsibilities": "University of Virginia Sports Medicine seeks responsible, motivated, and organized undergraduate students to assist in player hydration on the field during football practices",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Academic Tutor - Content Specialist (Staff Wage and Grad Student Wage)",
      "conciseDescription": "The University of Virginia is a highly competitive Division I program committed to academic and athletic excellence. The Department of Athletics at the University of Virginia is now accepting applications for the position of Academic Tutor - Content Specialist. The University of Virginia Department of Athletics Academic Affairs Department is looking for dedicated Academic Tutors - Content Specialists.",
      "timePosted": "2023-10-24",
      "wage": "$25.00 - $30.00",
      "requirements": "Knowledge/Skills/Abilities: Must be able to maintain confidentiality and the UVA Honor Code Basic knowledge of Microsoft 365 Ability and willingness to work with a diverse student-athlete population and to assist students with varying levels of support",
      "responsibilities": "Content Specialists will work under the supervision of the Athletics Academic Affairs Learning Services staff to provide support to student-athletes enrolled in courses that fall under the main expertise listed above",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Bookstore/Central Grounds Parking": [
    {
      "title": "UVA Bookstore Student Worker (Student Wage)",
      "conciseDescription": "The UVA Bookstore is the official on-Grounds store for the University of Virginia. We are looking for a team of enthusiastic students who have an interest in developing skills in a real world business environment. You will gain experience in customer service, merchandising, marketing, technology and books.",
      "timePosted": "2024-07-16",
      "wage": "N/A",
      "requirements": "Not specified.",
      "responsibilities": "We are looking for a team of enthusiastic students who have an interest in developing skills in a real world business environment",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Campbell Hall": [
    {
      "title": "Fine Arts Library Assistant - Federal Work Study Position (Student Wage)",
      "conciseDescription": "Fine Arts Library Assistant Work Study The Fine Arts Library is seeking undergraduate student workers for 2024/2025 school year and beyond. Student Assistants provide front-line customer service in a busy library that specializes in subjects such as art, architecture, archaeology, and classics. The Fine Arts Library is attached to Campbell Hall, behind the Fralin / UVa Art Museum.",
      "timePosted": "2024-06-27",
      "wage": "$14.53",
      "requirements": "Students interested in this position should be dependable, have excellent attention to detail, and be proactive in helping others",
      "responsibilities": "Fine Arts Library Assistant Work Study The Fine Arts Library is seeking undergraduate student workers for 2024/2025 school year and beyond",
      "startDate": "August 27",
      "eligibility": "Federal Work Study"
    }
  ],
  "Old Ivy Hall": [
    {
      "title": "Cavalier Connect Student Fundraiser (Student Wage)",
      "conciseDescription": "Cavalier Connect, the Student Fundraising Center, is currently seeking Student Fundraisers to speak with alumni, parents, and friends of the University of Virginia in order to raise funds, maintain records, and share information on behalf of the University. Cavalier Connect typically raises over $250,000 per year for vital University programs including most schools and units, Parents Fund, University Libraries, Scholarships, and many more. This is an in-person position.",
      "timePosted": "2024-03-21",
      "wage": "$250",
      "requirements": "· Starting pay: $18.00/hour · Hours per week: 10 hours minimum · Leadership opportunities available · Excellent experience for resume building · Comprehensive training for all Student Fundraisers · Additional incentives Calling Shifts: Monday-Thursday 6:00-9:30 pm, Friday 2-5:30 pm, Sundays 2-5:30 pm and 6:00-9:30 pm (must be available to work 3 of the 7 call shifts per week, shift availability may vary) Hiring for Fall 2024 and beyond (including summer positions) Required Qualifications Excellent communication skills, including a willingness to ask for financial contributions Exhibits genuine enthusiasm and support of the University Ability to manage time effectively, balancing academic, social, and work schedule on a consistent basis Attention to detail Must be able to work three available shifts Duties and Responsibilities Make calls to alumni, parents, and friends of UVA Request gifts and pledges to support the University and its mission for students Engage constituents with news and current events at the University Maintain University records by updating constituents contact information Comply with all policies and procedures of Cavalier Connect and the University Position open to all full-time University students, including work-study",
      "responsibilities": "Cavalier Connect, the Student Fundraising Center, is currently seeking Student Fundraisers to speak with alumni, parents, and friends of the University of Virginia in order to raise funds, maintain records, and share information on behalf of the University",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Ridley Hall": [
    {
      "title": "Student Part-time Lab Manager (Student Wage)",
      "conciseDescription": "The Research in Education and Learning (REAL) Lab at the University of Virginia, directed by Dr. Jamie Jirout, is seeking a part-time lab manager with an immediate start date (mid-March), and continuing through 2025. This position is open to all UVA students eligible for student employment , and federal work study eligibility is preferred.",
      "timePosted": "2024-03-06",
      "wage": "$16.21-26.15",
      "requirements": "The position will pay hourly with an expected range of $16.21-26.15 depending on prior experience and academic level",
      "responsibilities": "The REAL lab investigates how curiosity develops, the ways that classroom learning experiences influence academic curiosity, and how curiosity can support learning, especially within Science, Technology, Engineering, and Math (STEM) learning contexts",
      "startDate": "Not specified.",
      "eligibility": "Federal Work Study"
    }
  ],
  "Ray C. Hunt Drive 560": [
    {
      "title": "Nursing Research Student PRN (Student Wage)",
      "conciseDescription": "The UVA Center for Diabetes Technology is seeking nursing students to assist nurses with trials centering around diabetes. This position will include an introduction to and use of state of the art diabetes technology, patient contact, and clinical research design. Tasks: All duties are research -related and will be managed by clinical research staff and a licensed nurse Follow role-appropriate study procedures to support on-site clinical research Record and monitor data and electronic elements into paper and electronic mediums Assist study staff as needed according to training Learn and follow proper research protocol, regulatory compliance, and privacy rules May assist with document review and processing including: checking data from completed forms for accuracy and completeness and data processing through code assignment, transcription, and redaction Requirements: 2nd year or higher UVA nursing students OR UVA students who are EMTs Ability to follow directions, clinical protocol, and in-patient unit rules Ability to learn to monitor and support commercial and research diabetes treatment devices Ability to complete all protocol, regulatory, and device training General computer proficiency and experience with MS Office Suite Ability to work variable shifts, minimum 4-hour duration Willingness to learn and use electronic shift planning software Ability to sit for extended periods of time Able to follow HIPAA guidelines regarding patient health information.",
      "timePosted": "2023-07-21",
      "wage": "$15",
      "requirements": "Not specified.",
      "responsibilities": "The UVA Center for Diabetes Technology is seeking nursing students to assist nurses with trials centering around diabetes",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Leake Building": [
    {
      "title": "Student Assistant, Geospatial Engineering Services (Student Wage)",
      "conciseDescription": "Facilities Management, Geospatial Engineering Services is looking for student workers to assist with a variety of geospatial projects and data collection over the summer. The area of interest for Summer 2023 includes infrastructure mapping and classification for ADA routes, parking and transportation infrastructure, and building floor plans. Students will use a variety of geospatial tools to assist the GES Team with providing geospatial solutions to customers across the University.",
      "timePosted": "2023-07-09",
      "wage": "$17.00",
      "requirements": "Not specified.",
      "responsibilities": "Facilities Management, Geospatial Engineering Services is looking for student workers to assist with a variety of geospatial projects and data collection over the summer",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    }
  ],
  "Slaughter Recreation Center": [
    {
      "title": "Fitness & Instruction Personal Trainer or Group Fitness Instructor (Student Wage)",
      "conciseDescription": "Personal Trainer: Nationally recognized personal training certification such as ACE, ACSM, NASM, NSCA, etc. is required. Some experience administering fitness assessments and/or consultations.",
      "timePosted": "2023-07-09",
      "wage": "$16-$28",
      "requirements": "is required",
      "responsibilities": "Not specified.",
      "startDate": "Not specified.",
      "eligibility": "Student Wage"
    },
    {
      "title": "Outdoor Adventure (Equipment Coordinator, Climbing Center Coordinator, Poplar Ridge Challenge Course Coordinator, Trip Leader)",
      "conciseDescription": "Outdoor Adventure Equipment Coordinator: Area Specific Responsibilities: To assist customers in outfitting trips by ensuring proper rentals of needed camping and paddling equipment. To responsibly handle the monetary transactions of the outdoor recreation rental center according to PCI regulations and through the completion of the appropriate forms for rentals and refunds. Monitor use the bouldering wall and ensure all users have completed the required Bouldering Orientation before climbing.",
      "timePosted": "2023-07-09",
      "wage": "$200",
      "requirements": "Monitor use the bouldering wall and ensure all users have completed the required Bouldering Orientation before climbing",
      "responsibilities": "Outdoor Adventure Equipment Coordinator: Area Specific Responsibilities: To assist customers in outfitting trips by ensuring proper rentals of needed camping and paddling equipment",
      "startDate": "Not specified.",
      "eligibility": "Not specified."
    }
  ]
}