[
  {
    "job_title": "Marketing Analytics Intern",
    "company_name": "SoundCloud",
    "location": "New York, United States",
    "time_posted": "3 days ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Marketing and Sales",
    "Industries": "Entertainment Providers",
    "skills_desired": "python, sql, java",
    "degree_qualifications": NaN,
    "job_responsibilities": "Founded in 2007, SoundCloud is an artist-first platform empowering artists to build and grow their careers by providing them with the most progressive tools, services, and resources. | Our DEI-focused program is designed to create sustainable pipelines to invest in SoundCloud’s future, discover new, diverse talent at all levels, and develop future leaders who will contribute to all business areas. | They will work closely with the team to conduct data-driven research aimed at understanding user behaviors, particularly focused on user identification and retention strategies.Key ResponsibilitiesConduct exploratory data analysis to understand an... | Diversity and open expression are fundamental to our organization; they help us lead what’s next in music by understanding and empowering our creators and fans, no matter their identity."
  },
  {
    "job_title": "IT Data Analytics Intern - Summer 2025",
    "company_name": "Juniper Networks",
    "location": "Sunnyvale, CA",
    "time_posted": "2 weeks ago",
    "num_applicants": "168 applicants",
    "Seniority Level": "Mid-Senior level",
    "Employment Type": "Full-time",
    "Job Function": "Other",
    "Industries": "Computer and Network Security, Computer Networking Products, and Telecommunications",
    "skills_desired": "sql, aws",
    "degree_qualifications": "bachelor, master",
    "job_responsibilities": "Juniper Networks is seeking students for Summer 2025 Data Analytics Internships to work on impactful projects and develop essential skills.We are looking for individuals excited about solving real-world business challenges through data. | Interns will gain exposure to data analysis, visualization, and insights generation to support key decision-making processes. | This role is crucial in helping our team optimize operations, enhance efficiency and drive data-driven strategies potentially using latest AI technologies.Responsibilities:As a Data Analytics Intern, you will:Work with large datasets to uncover tr... | In addition, you will join our comprehensive University Talent Program that fosters personal as well as professional growth, thoroughly preparing interns for the next step in their careers. | Interns are mentored by some of the most talented and skillful innovators in the industry; you will connect with transformative thought leaders who promote disruptive ideas in their field."
  },
  {
    "job_title": "Marketing Data Science Intern",
    "company_name": "Auctane",
    "location": "Austin, TX",
    "time_posted": "3 weeks ago",
    "num_applicants": "191 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Marketing and Sales",
    "Industries": "Software Development",
    "skills_desired": "r, sql, tableau",
    "degree_qualifications": "undergraduate, graduate",
    "job_responsibilities": NaN
  },
  {
    "job_title": "Intern, E-Commerce",
    "company_name": "Giorgio Armani",
    "location": "New York, NY",
    "time_posted": "3 days ago",
    "num_applicants": "101 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Sales and Business Development",
    "Industries": "Retail Apparel and Fashion",
    "skills_desired": NaN,
    "degree_qualifications": "undergraduate, graduate",
    "job_responsibilities": NaN
  },
  {
    "job_title": "Intern (bolt US Marketing Team)",
    "company_name": "bolt",
    "location": "Austin, Texas Metropolitan Area",
    "time_posted": "2 weeks ago",
    "num_applicants": "118 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Marketing",
    "Industries": "Insurance",
    "skills_desired": NaN,
    "degree_qualifications": NaN,
    "job_responsibilities": "As a bolt intern…You will have the opportunity to gain on-the-job experience and training while managing your own project. | You will be embedded in a team working alongside some of our best subject-matter-experts (SMEs). | You will also be supported by our intern program which offers a structured learning experience. | You will be working with the U.S. | This internship offers hands-on experience across Design & Branding, Performance Marketing, Content Marketing, and Product Marketing."
  },
  {
    "job_title": "Data Editorial Intern, Yahoo Finance",
    "company_name": "Yahoo",
    "location": "United States",
    "time_posted": "4 days ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Full-time",
    "Job Function": "Information Technology",
    "Industries": "Software Development",
    "skills_desired": "python, spark",
    "degree_qualifications": "bachelor, master, phd",
    "job_responsibilities": "As an intern, you will gain valuable work experience while developing your skills and establishing a track record to set you up for your future career.A Lot About YouYou demonstrate strong interpersonal skills, attention to detail, and use creativ... | You are an avid problem solver who has the capability to work independently as well as collaborate within a team. | When you support everyone to be their best selves, they spark discovery, innovation and creativity."
  },
  {
    "job_title": "Intern - Data Science, Finance & Accounting",
    "company_name": "MidAmerican Energy Company",
    "location": "Des Moines, IA",
    "time_posted": "1 day ago",
    "num_applicants": "72 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Part-time",
    "Job Function": "Engineering and Information Technology",
    "Industries": "Utilities",
    "skills_desired": "python, sql, power bi, azure",
    "degree_qualifications": "bachelor",
    "job_responsibilities": NaN
  },
  {
    "job_title": "Intern, Systems Biology",
    "company_name": "Strand Therapeutics",
    "location": "Boston, MA",
    "time_posted": "3 weeks ago",
    "num_applicants": "193 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Research, Analyst, and Information Technology",
    "Industries": "Biotechnology Research",
    "skills_desired": "python, r",
    "degree_qualifications": "phd, graduate",
    "job_responsibilities": "This collaboration led them to build their own mRNA \"programming language,\" creating the world's first platform for mRNA smart therapies.The founders and scientific advisors of Strand Therapeutics are made up of well-known and highly regarded indi... | The incoming candidate will work closely with drug pipeline program and platform teams to analyze data from a variety of sources, including bioanalytical, flow cytometry, and next gen sequencing, and use results therefrom to inform drug development. | Strand does not accept unsolicited resumes from any source other than directly from candidates.Job Type: InternSalary: Commensurate with role and experience\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            S..."
  },
  {
    "job_title": "IT Intern",
    "company_name": "Jenner & Block",
    "location": "San Francisco, CA",
    "time_posted": "1 week ago",
    "num_applicants": "153 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Information Technology",
    "Industries": "Law Practice",
    "skills_desired": NaN,
    "degree_qualifications": NaN,
    "job_responsibilities": "1 pro bono firm in the United States 10 times.OverviewThe IT Department Summer Intern is responsible for assisting the San Francisco office technical support staff with the computer support of the San Francsico office attorneys and staff. | This position reports to the San Fransisco Technical Support Supervisor.Primary ResponsibilitiesSetting up and installing computer hardwareSetting up and monitoring video conferencesAssisting users with basic computer problems and issuesPerforming..."
  },
  {
    "job_title": "2025-2026 Yearlong Finance and Data Analytics Intern",
    "company_name": "Chicago Transit Authority",
    "location": "Chicago, IL",
    "time_posted": "1 week ago",
    "num_applicants": "39 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Finance and Sales",
    "Industries": "Urban Transit Services",
    "skills_desired": "sql, excel",
    "degree_qualifications": NaN,
    "job_responsibilities": "Students receive exposure to the discipline of the workplace and are guided by subject matter experts who assist them in acquiring the skills, knowledge, and experience needed to perform in today’s technically demanding careers. | All majors are welcome to apply, but please see education experience/requirements for specifics about what disciplines each internship project is seeking.Internships are part-time (15 hours a week) during the school year and full-time (40 hours a ... | Build high-level dashboards to track and communicate progress and key findings. | CTA will work with you to determine if an accommodation can be provided.Primary Location: USA-Illinois-ChicagoJob: InternshipJob Posting: Mar 19, 2025, 5:39:26 PMPosition Type: Part-time Temporary (PTT)\n        \n\n\n        \n            Show more\n  ..."
  },
  {
    "job_title": "Operations & Administrative Intern",
    "company_name": "Holiday HOOPS & ARTs",
    "location": "Orlando, FL",
    "time_posted": "2 weeks ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Management and Manufacturing",
    "Industries": "Non-profit Organizations",
    "skills_desired": "excel",
    "degree_qualifications": "bachelor",
    "job_responsibilities": "As first-generation university students who met at a historically Black college, our founders were inspired to build this platform. | Our founders' lived experiences inspired them to create HH&A and ensure future generations get the same support of mentorship, groundedness, and education they received. | OPERATIONSWork closely with the Co-CEOs and Assistant to the CEO to plan athletic, arts, health, and skills-based programs, including setup, scheduling, and coordination.Support the Co-CEO of Development & Strategy in thinking through logistics an..."
  },
  {
    "job_title": "Sales Analytics Intern",
    "company_name": "HP",
    "location": "Spring, TX",
    "time_posted": "6 days ago",
    "num_applicants": "191 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Full-time",
    "Job Function": "Sales and Business Development",
    "Industries": "Computer Hardware Manufacturing, Software Development, and IT Services and IT Consulting",
    "skills_desired": "excel",
    "degree_qualifications": NaN,
    "job_responsibilities": "will not provide any assistance or sign documentation in support of immigration sponsorship including Curricular Practical Training (CPT) or Optional Practical Training (OPT).Candidates who identify with a group that is historically underrepresent... | Our internships have a thoughtful balance of networking, executive speakers, community involvement, big meaty projects (no paper filing here!) and fun!The TeamCommercial OrganizationResponsibilitiesAnalyze sales data to identify trends and opportu... | At HP, the future is yours to create."
  },
  {
    "job_title": "Samsung Ads - Machine Learning Intern – Gen AI",
    "company_name": "Samsung Electronics America",
    "location": "Mountain View, CA",
    "time_posted": "2 weeks ago",
    "num_applicants": "108 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Full-time",
    "Job Function": "Engineering and Information Technology",
    "Industries": "Computers and Electronics Manufacturing",
    "skills_desired": "tensorflow, keras",
    "degree_qualifications": "phd",
    "job_responsibilities": "The Platform Intelligence (PI) team at Samsung Ads is actively exploring the latest deep learning and generative AI techniques to improve our existing systems and products and create new revenue streams. | As a deep learning / generative AI intern, you will have access to unique Samsung proprietary data to develop and deploy a broad spectrum of large-scale machine learning products with real-world impact. | You will build Generative AI applications for the Ad domain to enhance user experiences and create new business opportunities. | You will work closely with and be supported by a talented engineering team and top-notch researchers to work on exciting machine learning projects and state-of-the-art technologies. | Publications and patents are expected as outputs of an internship.ResponsibilitiesRole and ResponsibilitiesExplore cutting-edge machine learning technologies for our productsDesign and develop deep learning algorithms and models for real-world pro..."
  },
  {
    "job_title": "AI Intern",
    "company_name": "OneStream Software",
    "location": "United States",
    "time_posted": "1 week ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Full-time",
    "Job Function": "Engineering and Information Technology",
    "Industries": "Software Development",
    "skills_desired": "python, sql, java, azure",
    "degree_qualifications": "bachelor, graduate",
    "job_responsibilities": "As an intern, you will have the opportunity to gain hands-on experience in the Corporate Performance Management (CPM) industry.As an Intern on the AI Product and Engineering team, you will gain experience in our AI initiatives within the OneStream... | The AI Product and Engineering team is focused on bridging the gap between AI research and AI products, bringing tangible and quantifiable value to our end users."
  },
  {
    "job_title": "Intern - Financial Analysis & Business Analytics",
    "company_name": "Titan America",
    "location": "Norfolk, VA",
    "time_posted": "2 weeks ago",
    "num_applicants": NaN,
    "Seniority Level": "Entry level",
    "Employment Type": "Part-time",
    "Job Function": "Analyst and Finance",
    "Industries": "Wholesale Building Materials",
    "skills_desired": "r, excel, tableau",
    "degree_qualifications": NaN,
    "job_responsibilities": "Our products protect human life and personal property, improve the quality of life, generate economic prosperity and connect society.Opportunity:We are looking for a Financial Analysis & Business Analytics Intern at our corporate office in Norfolk..."
  },
  {
    "job_title": "Data Visualization Specialist Intern, Marketing",
    "company_name": "GQG Partners",
    "location": "Fort Lauderdale, FL",
    "time_posted": "2 weeks ago",
    "num_applicants": "125 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Information Technology",
    "Industries": "Financial Services",
    "skills_desired": NaN,
    "degree_qualifications": "bachelor, master",
    "job_responsibilities": "We endeavor to create a business that is closely aligned with our clients’ financial interests. | The team also focuses on digital marketing, event coordination, public relations, and supporting investor relations to maintain a positive image and attract investment.Analyzing client and prospect behavior informs content strategy and client expe... | The person in this role is expected to join the team with a willingness to learn and contribute new ideas.Key ResponsibilitiesProvide visual and technical guidance for the data visualization project.Develop a high impact data visualization experie... | This policy applies to all aspects of employment, including recruitment, placement, promotion, transfer, demotion, compensation, benefits, social and recreational activities and termination.For more information about equal employment opportunity, ..."
  },
  {
    "job_title": "IT Intern",
    "company_name": "BL Harbert International LLC",
    "location": "Birmingham, AL",
    "time_posted": "18 hours ago",
    "num_applicants": "36 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Information Technology",
    "Industries": "IT Services and IT Consulting",
    "skills_desired": NaN,
    "degree_qualifications": NaN,
    "job_responsibilities": "Technical Support: Provide first-level support for hardware and software issues, troubleshoot problems, and assist with installations.System Maintenance: Monitor system performance, support backups and data recovery, and help maintain IT infrastru..."
  },
  {
    "job_title": "IT Data Intern",
    "company_name": "BBYO",
    "location": "Washington, DC",
    "time_posted": "6 days ago",
    "num_applicants": "83 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Information Technology",
    "Industries": "Non-profit Organizations",
    "skills_desired": "excel",
    "degree_qualifications": NaN,
    "job_responsibilities": "We will work with your college schedule! | The IT Data internship is ideal for a college student studying IT, computer science, business (or any related field) who wants to contribute creatively to a global organization with a growing audience of over 80,000 teens worldwide.What you’ll get... | Manage a proactive approach to the data quality of the Membership and Donor databases including: Consistent review of duplicate records Usage of multiple data sources to investigate and update incorrect or incomplete data points Working with QC re... | Assist with creation of forms to collect event registrations and personal information Update design of CRM Review and update, as necessary, documentation of all data entry procedures and processes. | Assist with the creation of training materials, communicating training on the system, and resolution of system and process questions."
  },
  {
    "job_title": "Marketing Analytics Intern (Summer start)",
    "company_name": "AARP",
    "location": "Washington, DC",
    "time_posted": "3 days ago",
    "num_applicants": "192 applicants",
    "Seniority Level": "Not Applicable",
    "Employment Type": "Internship",
    "Job Function": "Marketing and Sales",
    "Industries": "Non-profit Organizations",
    "skills_desired": "python, r, tableau, power bi",
    "degree_qualifications": "bachelor, master, graduate",
    "job_responsibilities": "This includes using data science, data engineering, predictive modeling, and market analytics to guide data driven decision making.As a  Marketing Analytics Intern, you will play a crucial role in enhancing our organization's ability to measure, a... | You will engage with advanced analytical methodologies, including attribution modeling, media mix modeling (MMM), incrementality testing, and audience segmentation. | This internship provides hands-on experience in marketing analytics, offering the chance to collaborate with seasoned marketing and analytics professionals while driving data-driven insights and strategies."
  },
  {
    "job_title": "IT Intern",
    "company_name": "ARAUCO - North America",
    "location": "Atlanta, GA",
    "time_posted": "1 week ago",
    "num_applicants": "109 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Information Technology",
    "Industries": "Manufacturing",
    "skills_desired": "sql",
    "degree_qualifications": "bachelor, graduate",
    "job_responsibilities": "This role requires collaboration with our Continuous Improvement and Supply Chain teams.ResponsibilitiesDevelop and maintain data reports and dashboards.Utilize data in the cloud to create predictive models for several business needs.Integrate dat..."
  },
  {
    "job_title": "Information Technology Intern - Data Analytics",
    "company_name": "Little Rock Zoo",
    "location": "Little Rock, AR",
    "time_posted": "16 hours ago",
    "num_applicants": "60 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Information Technology",
    "Industries": "Museums, Historical Sites, and Zoos",
    "skills_desired": "python, sql, excel, power bi",
    "degree_qualifications": NaN,
    "job_responsibilities": "This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.Job Objective & Safety/Security Sensit... | Application and Supplemental Questions required by the Closing Date.SECONDARY DUTIESPerforms other related duties as required.Knowledge, Skills And AbilitiesKnowledge of the methods and techniques of computer/help desk operations.Knowledge of comp..."
  },
  {
    "job_title": "Engineering Intern",
    "company_name": "Barnes",
    "location": "East Granby, CT",
    "time_posted": "2 weeks ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Full-time",
    "Job Function": "Engineering",
    "Industries": "Airlines and Aviation",
    "skills_desired": NaN,
    "degree_qualifications": "undergraduate, graduate",
    "job_responsibilities": "Core Responsibilities: Working directly with the Engineering team and shop floor personnel on various assignments including:Inspection work instructionsData administration - ensuring current specification complianceRepair process work instructions... | At Barnes, career development is a shared responsibility in which all employees are encouraged to develop, improve, and enhance their skills and professional growth to support our business objectives.This job position may include access to control..."
  },
  {
    "job_title": "GIS Intern",
    "company_name": "Houston Engineering, Inc.",
    "location": "Maple Grove, MN",
    "time_posted": "5 days ago",
    "num_applicants": "26 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Engineering",
    "Industries": "Civil Engineering",
    "skills_desired": NaN,
    "degree_qualifications": NaN,
    "job_responsibilities": "The challenge and opportunity you seek can be found at Houston Engineering!We are looking for a GIS intern for the summer of 2025. | Assist in all aspects of GIS map generation including data creation and editing, querying and spatial analysis, map compilation and map production. | Create and modify GIS datasets; manage and maintain legacy GIS datasets; develop and implement GIS-based analyses supporting our Water Resources sector. | Maintain geospatial data on desktop, mobile, and cloud applications. | Create and modify GIS datasets; manage and maintain legacy GIS datasets; develop and implement GIS-based analyses supporting drainage system management, watershed districts and other water resource projects."
  },
  {
    "job_title": "Vehicle Compliance & Analysis Junior Associate Consultant (Intern)",
    "company_name": "Mercedes-Benz USA",
    "location": "Jacksonville, FL",
    "time_posted": "2 weeks ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Business Development and Sales",
    "Industries": "Motor Vehicle Manufacturing",
    "skills_desired": "excel",
    "degree_qualifications": NaN,
    "job_responsibilities": "AufgabenAbout UsMercedes-Benz USA is responsible for the sales, marketing and service of all Mercedes-Benz and Maybach products in the United States. | We are looking for diverse top-notch individuals to join the Mercedes-Benz Team and uphold these hallmarks.Mercedes-Benz USA VCA Junior Associate Consultant (JAC) Overview and ResponsibilitiesVehicle Compliance and Analysis (“VCA”) is responsible ... | This includes, but is not limited to, government compliance reporting, emissions and safety certification, quality campaigns, VPC actions, and product analysis activities.Primary responsibilities of an MBUSA VCA Junior Associate Consultant:Support... | Assist the Safety team with Transportation Recall Enhancement, Accountability, and Documentation (“TREAD”) Act, assist in ad-hoc reports, and campaign launch activities.Help in the coordination, creation and dissemination of Recall and Service cam... | The candidate will need to possess skills to assess and analyze large volumes of data to assist management to streamline processes and procedures."
  },
  {
    "job_title": "Machine Learning Intern (LLM for Security)",
    "company_name": "SHEIN Technology LLC",
    "location": "Los Angeles, CA",
    "time_posted": "20 hours ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Engineering and Information Technology",
    "Industries": "Retail Apparel and Fashion",
    "skills_desired": "python, scikit-learn, tensorflow, aws, azure",
    "degree_qualifications": "undergraduate, graduate",
    "job_responsibilities": "In SHEIN, we work with outstanding, creative, and capable peers. | This role will focus on detecting security threats, automating security operations workflows, and enhancing threat intelligence capabilities using AI/ML techniques.As an intern, you will collaborate with security engineers, data scientists, and AI... | This is an exciting opportunity for a graduate student or advanced undergraduate looking to apply AI/ML research in real-world cybersecurity challenges.In this role, you will gain hands-on experience developing AI/ML models for real-world security..."
  },
  {
    "job_title": "Computer Science Intern - Summer 2025 (Hybrid or Remote)",
    "company_name": "California ISO",
    "location": "Folsom, CA",
    "time_posted": "1 week ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Full-time",
    "Job Function": "Information Technology",
    "Industries": "Utilities",
    "skills_desired": "python, r, sql, java",
    "degree_qualifications": "bachelor, graduate",
    "job_responsibilities": "In the same way, the California ISO operates independently—managing the electron traffic on a power grid we do not own—making sure electricity is safely delivered to utilities and consumers on time and reliably.Job DescriptionWhat's In it for YouO... | Your work as an intern can impact millions of people who depend on electricity for their everyday lives.You will get \"real world\" experience to begin or further your career pursuits in the energy industry. | This is a paid intern position for 10 -12 weeks during summer 2025.You get to work on interesting and challenging assignments that will help grow your skill set.Opportunities to interact with the CEO and the Executive team of the ISO.Invitations t... | You will learn more about smart grid technology, renewable resources, forecasting and the latest developments in energy industry. | You will see how the work you do this summer contributes directly to the success of the California Grid.Data validation and user acceptance testing (UAT), schedule and monitor processes necessary for calculation and publication of energy market se..."
  },
  {
    "job_title": "New Business Intern",
    "company_name": "Veolia",
    "location": "Hackensack, NJ",
    "time_posted": "1 week ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Education and Training",
    "Industries": "Environmental Services",
    "skills_desired": NaN,
    "degree_qualifications": NaN,
    "job_responsibilities": "Communicates issues and roadblocks related to areas of responsibilityMay assist in research or special projects in a variety of areas in order to fulfill business initiatives and meet business objectivesMay be asked to prepare and deliver insights... | Ability to build collaborative relationships."
  },
  {
    "job_title": "Supply Chain -  Intern, Graduate",
    "company_name": "Intel Corporation",
    "location": "Greater Phoenix Area",
    "time_posted": "1 week ago",
    "num_applicants": "36 applicants",
    "Seniority Level": "Entry level",
    "Employment Type": "Full-time",
    "Job Function": "Management and Manufacturing",
    "Industries": "Semiconductor Manufacturing",
    "skills_desired": "python, sql",
    "degree_qualifications": "bachelor, master, phd, graduate",
    "job_responsibilities": "Embark with us on a journey of growth and transformation as we create exceptionally engineered technology and bring AI everywhere. | Join us and build on our legacy of innovation and collaboration as we deliver world-changing technology that improves the life of every person on the planet.As a graduate-level intern in our supply chain organization, you will work on a project to... | Experience would be obtained through a combination of prior education level classes, and current level school classes, projects, research, and relevant previous job and/or internship experience.Education: Candidate must be enrolled/pursuing a Mast..."
  },
  {
    "job_title": "AZ Tech Intern",
    "company_name": "Allianz Technology",
    "location": "Minneapolis, MN",
    "time_posted": "5 months ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Full-time",
    "Job Function": "Engineering and Information Technology",
    "Industries": "Financial Services and Insurance",
    "skills_desired": NaN,
    "degree_qualifications": NaN,
    "job_responsibilities": NaN
  },
  {
    "job_title": "Platform Campaign Intern (TikTok Shop - Operations) - 2025 Summer Start (BS/MS)",
    "company_name": "TikTok",
    "location": "Seattle, WA",
    "time_posted": "4 days ago",
    "num_applicants": "50 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Information Technology",
    "Industries": "Entertainment Providers",
    "skills_desired": NaN,
    "degree_qualifications": "bachelor, master",
    "job_responsibilities": "In this role, you will be engaged in platform-wide major campaigns of TikTok Shop and drive impactful business success.We are looking for talented individuals to join us for an internship in 2025. | Here, You Will Utilize Your Knowledge In Real-world Scenarios While Laying a Strong Foundation For Personal And Professional Growth. | Applications will be reviewed on a rolling basis - we encourage you to apply early.Responsibilities: Assist in TikTok Shop major platform campaign implementation. | When we create and grow together, the possibilities are limitless."
  },
  {
    "job_title": "Technology, Media and Telecom (TMT) Intern",
    "company_name": "Boston Consulting Group (BCG)",
    "location": "Chicago, IL",
    "time_posted": "1 week ago",
    "num_applicants": "59 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Full-time",
    "Job Function": "Finance and General Business",
    "Industries": "Business Consulting and Services and Professional Services",
    "skills_desired": "excel, spark",
    "degree_qualifications": "bachelor, master",
    "job_responsibilities": "BCG delivers solutions through leading-edge management consulting along with technology and design, corporate and digital ventures—and business purpose. | for business and people analysis tasks) and a structured way of thinking and communicatingAdvanced knowledge MS Office, particularly Excel and PowerPointExceptional organizational, planning and project management skills; strong at conceptualizatio..."
  },
  {
    "job_title": "Research Intern - IMAIS - Adaptive Closed-Loop Interaction",
    "company_name": "Microsoft Power Platform Community",
    "location": "Cambridge, MA",
    "time_posted": "2 months ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Research, Analyst, and Information Technology",
    "Industries": "Software Development",
    "skills_desired": "r, pandas, scikit-learn, tensorflow",
    "degree_qualifications": "phd",
    "job_responsibilities": "Understanding and influencing well-being in the workplace requires interdisciplinary efforts in Human-Computer Interaction (HCI), Affective Computing, Machine Learning, Systems, Design, Psychology, and human physiology. | We enable interactions through various modalities—including touch, gestures, speech, sound, gaze, smell, and physiological signals—and consider wearables and other devices integral to delivering next-generation computing experiences.During this Re... | Examples of related projects include multimodal processing for behavioral and physiological sensing, image-grounded language understanding and generation, building and deploying agents for productivity and well-being support, and reducing cognitiv... | As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. | Alongside fellow doctoral candidates and some of the world’s best researchers, Research Interns learn, collaborate, and network for life."
  },
  {
    "job_title": "Intern - Finance",
    "company_name": "NetApp",
    "location": "United States",
    "time_posted": "3 days ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Full-time",
    "Job Function": "Finance and Sales",
    "Industries": "Software Development",
    "skills_desired": "excel",
    "degree_qualifications": NaN,
    "job_responsibilities": "Ability to build strong working relationships across all levels of the organization, including remote areas. | Finally, we provide financial savings programs to help you plan for your future.If you want to help us build knowledge and solve big problems, let's talk."
  },
  {
    "job_title": "Business Systems Intern - Summer 2025",
    "company_name": "C&S Wholesale Grocers",
    "location": "Keene, NH",
    "time_posted": "1 month ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Information Technology",
    "Industries": "Retail",
    "skills_desired": "r, sql, excel",
    "degree_qualifications": "bachelor",
    "job_responsibilities": "As an Intern at C&S, you will have the unique opportunity to gain hands-on experience in the wholesale grocery industry, contribute to meaningful projects, and better understand what goes into running one of the largest privately held companies in..."
  },
  {
    "job_title": "OBD Certification & Compliance Intern",
    "company_name": "Mercedes-Benz Research & Development North America, Inc.",
    "location": "Long Beach, CA",
    "time_posted": "3 days ago",
    "num_applicants": "46 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Information Technology",
    "Industries": "Motor Vehicle Manufacturing",
    "skills_desired": "python, excel, power bi",
    "degree_qualifications": "bachelor, master, undergraduate, graduate",
    "job_responsibilities": "At Mercedes-Benz Research & Development North America (MBRDNA), we are committed to delivering world-class automotive technologies that push the boundaries of what is possible. | Frequent sitting, standing and reaching with hands.Preferred Qualifications:German language skills a plus Python or other programming experience Powertrain development experienceBenefits/Perks:•  PTO• Sick TimeAdditional Information:The current ho... | MBRDNA is not responsible for any fees or claims related to receipt of unsolicited resumes.Mercedes-Benz Research and Development North America, Inc.PRIVACY NOTICE FOR CALIFORNIA RESIDENTShttps://mbrdna.com/california-employee-privacy-notice/\n\n\n\n ..."
  },
  {
    "job_title": "Paid Probation Intern",
    "company_name": "New Jersey Courts",
    "location": "Paterson, NJ",
    "time_posted": "1 month ago",
    "num_applicants": "47 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Education and Training",
    "Industries": "Administration of Justice",
    "skills_desired": NaN,
    "degree_qualifications": "undergraduate",
    "job_responsibilities": "DescriptionWhen you come to work for New Jersey Judiciary you will join an 8500-member strong TEAM that operates with the highest standards of independence, integrity, fairness and quality service. | You will be engaged with work that has purpose, meaning and makes a difference in lives of the public we serve. | We work hard every day to build the public’s trust and confidence in our court system, which includes issues such as bail reform, marijuana decriminalization and recovery court. | Probation is seeking dynamic, engaged undergraduate students in the social and behavioral science majors who are interested in broadening their understanding and gaining experience to a wide array of the judicial court system, probation, post disp... | 2011, Chapter 70), the \"New Jersey First Act,\" all persons newly hired by the Judiciary within one year must establish, and then maintain, principal residence in the State of New Jersey."
  },
  {
    "job_title": "Summer 2025, HAMR Media Tribology intern (Ph.D. Only)",
    "company_name": "Western Digital",
    "location": "San Jose, CA",
    "time_posted": "1 week ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Engineering",
    "Industries": "Computer Hardware Manufacturing, Computers and Electronics Manufacturing, and Semiconductor Manufacturing",
    "skills_desired": "r",
    "degree_qualifications": "graduate",
    "job_responsibilities": "Together, we can build the future of data storage.Job DescriptionAs a HAMR Media Tribology intern, you will be part of the HAMR Media R&D team responsible for improving the HAMR head-media interface reliability. | (2026 Graduate)Knowledge or Experience in Tribology, interface design, tribology testing, material analysis and instrumentKnowledge in head/media interface and HAMR technologyPossess data analytics and statistics skillsetExcellent problem-solving ... | Depending on your role and your performance, you may be eligible to participate in our annual Long-Term Incentive (LTI) program, which consists of restricted stock units (RSUs) or cash equivalents, pursuant to the terms of the LTI plan. | Please note that not all roles are eligible to participate in the LTI program, and not all roles are eligible for equity under the LTI plan."
  },
  {
    "job_title": "Intern, GSC Finance",
    "company_name": "Colgate-Palmolive",
    "location": "New York, NY",
    "time_posted": "1 week ago",
    "num_applicants": "175 applicants",
    "Seniority Level": "Not Applicable",
    "Employment Type": "Full-time",
    "Job Function": "Finance and Sales",
    "Industries": "Manufacturing, Transportation, Logistics, Supply Chain and Storage, and Retail",
    "skills_desired": "excel",
    "degree_qualifications": "undergraduate, graduate",
    "job_responsibilities": "Do you want to come to work with a smile and leave with one as well? | The qualified candidate will be able to work in New York full time during the summer months and part-time through the academic school year beginning in June 2025.If you are pursuing an undergraduate or graduate degree in Accounting or Finance, the..."
  },
  {
    "job_title": "Engineering Business Analyst Intern (Summer 2025)",
    "company_name": "GTI Energy",
    "location": "Greater Chicago Area",
    "time_posted": "2 weeks ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Part-time",
    "Job Function": "Analyst, Engineering, and Research",
    "Industries": "Non-profit Organizations, Oil and Gas, and Utilities",
    "skills_desired": "excel, power bi",
    "degree_qualifications": "undergraduate, graduate",
    "job_responsibilities": "Base pay range\n\n      $17.00/hr - $28.00/hr\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\nGeneral SummaryThe Heat & Power Group at GTI Energy is searching for an Engineering Business Analyst Intern to support our growing efforts supporting low carbon solutions for Buildings ... | Our research, development, and demonstration (RD&D) group works on a range of technology topics, including novel heat pump solutions, advanced building construction technologies, thermal energy storage, microgrid systems, low carbon fuel utilizati... | We support and uplift people, ensuring they have the resources and confidence needed to live as their authentic selves and reach their full potential.We offer generous benefits, competitive salaries, opportunities for professional growth and caree... | Gather, analyze, and interpret technical and business data to support engineering projects. | Conduct market research related to new technologies, tools, or methodologies that could improve engineering practices or business outcomes."
  },
  {
    "job_title": "Administrative Intern, Clinic",
    "company_name": "Peachtree Orthopedics",
    "location": "Atlanta, GA",
    "time_posted": "2 weeks ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Administrative",
    "Industries": "Internet Publishing",
    "skills_desired": "excel",
    "degree_qualifications": "undergraduate, graduate",
    "job_responsibilities": "In addition to project work, candidates will attend and document meetings, tour Peachtree Orthopedics facilities, present project findings to leadership team.Time CommitmentProgram dates: May 19, 2025 - August 8, 2025 (12 weeks)Students work full-... | Placement and location will be determined during the selection process.CompensationHourly rate: $18/hourHousing is not offered as part of compensationAdministrative ResponsibilitiesDepending on placement, administrative interns may:Assist with ope... | Requirements include:Education And ExperienceCurrent undergraduate or graduate student in healthcare administration or related fieldDemonstrated interest in healthcare and healthcare administrationSkillsLanguage Skills: Ability to read, analyze, a..."
  },
  {
    "job_title": "Computer Science Intern",
    "company_name": "ACES, Incorporated",
    "location": "Annapolis Junction, MD",
    "time_posted": "2 months ago",
    "num_applicants": "28 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Engineering and Information Technology",
    "Industries": "Information Technology & Services",
    "skills_desired": "python, r, java, tensorflow",
    "degree_qualifications": "bachelor",
    "job_responsibilities": "As an Intern at EverWatch, you will have the opportunity to learn from experienced AI architects and engineers, while working alongside high-potential peers tackling impactful innovations.Applying machine learning to extract insights from differen..."
  },
  {
    "job_title": "Summer Intern(s)",
    "company_name": "Industrial Info Resources",
    "location": "Sugar Land, TX",
    "time_posted": "6 days ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Education and Training",
    "Industries": "Information Services",
    "skills_desired": "excel",
    "degree_qualifications": NaN,
    "job_responsibilities": "You will be working closely with our team to conduct research, capture data, and attend meetings.Essential FunctionsUndertakes and/or participates in projects and programs designed to develop professional skills and expertise appropriate to the ne..."
  },
  {
    "job_title": "Software Engineering Intern: Central Management Office",
    "company_name": "Uplift Education",
    "location": "Dallas, TX",
    "time_posted": "4 days ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Engineering and Information Technology",
    "Industries": "Education Administration Programs",
    "skills_desired": "python, java",
    "degree_qualifications": "bachelor",
    "job_responsibilities": "This role will be based out of the Uplift CMO Dallas office but may offer flexibility of remote work (determined by intern lead). | Review and built AI based tool to complement tech career advising.Duties/Responsibilities:Collaborate with department teams to develop AI counseling assistant and career support initiativesSupport with planning, implementation, and execution of de..."
  },
  {
    "job_title": "Intern",
    "company_name": "ETHNUS",
    "location": "Bakersfield, CA",
    "time_posted": "1 year ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Education and Training",
    "Industries": "Higher Education",
    "skills_desired": "excel, aws",
    "degree_qualifications": NaN,
    "job_responsibilities": "Pioneering in employability enhancement and skill development since 2007, Ethnus provides training, certification, and placement support to its students in relevant industry-specific jobs. | Over 600 higher education institutions around the country trust our services to enhance and build the employability of their students. | Department: Business DevelopmentDesired Qualification: MBA (Marketing Specialization).Locations: Bangalore, Chennai, Coimbatore.Job DescriptionAs a Business Development Intern, you will work closely with the Business Development team, supporting v... | You will gain hands-on experience in market research, lead generation, client interaction, and business strategy execution."
  },
  {
    "job_title": "2025 Summer Intern - Supply Chain",
    "company_name": "Humacyte",
    "location": "Durham, NC",
    "time_posted": "3 days ago",
    "num_applicants": "100 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Management and Manufacturing",
    "Industries": "Biotechnology Research",
    "skills_desired": "sql, excel, power bi",
    "degree_qualifications": "undergraduate, graduate",
    "job_responsibilities": "DEPARTMENT: Supply ChainLOCATION: Durham, NC; Onsite/Not RemoteCOMPANY: Humacyte Inc (Nasdaq: HUMA) is developing a disruptive biotechnology platform to deliver universally implantable bioengineered human tissues, advanced tissue constructs, and o... | For more information, visit www.Humacyte.com .JOB SUMMARY:The Supply Chain Intern will work closely with supply chain teams to support data collection and analysis, metrics development, and process improvement activities.ESSENTIAL FUNCTIONS:Lead t... | Support Supply Chain metrics development and management. | Collaborate with the Supply Chain teams on various projects and process improvement initiatives. | Participate in regular meetings."
  },
  {
    "job_title": "Engineering Intern",
    "company_name": "Nestlé Health Science",
    "location": "Bohemia, NY",
    "time_posted": "6 days ago",
    "num_applicants": "52 applicants",
    "Seniority Level": "Associate",
    "Employment Type": "Internship",
    "Job Function": "Engineering",
    "Industries": "Food and Beverage Services",
    "skills_desired": "excel",
    "degree_qualifications": NaN,
    "job_responsibilities": "We also have extensive pharmaceutical expertise, offering innovative medicines that aim to prevent, manage, and treat gastrointestinal and metabolic-related diseases.At Nestlé Health Science, we bring our best for better lives. | Here we embrace the entrepreneurial spirit and collaborate with teams that champion focused and forward thinking. | Prior to the next step in the recruiting process, we welcome you to inform us confidentially if you may require any special accommodations in order to participate fully in our recruitment experience."
  },
  {
    "job_title": "Decal Lab Intern",
    "company_name": "Leidos",
    "location": "Webster, TX",
    "time_posted": "1 week ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Research, Analyst, and Information Technology",
    "Industries": "IT Services and IT Consulting",
    "skills_desired": "excel",
    "degree_qualifications": NaN,
    "job_responsibilities": "This position will provide hands-on fabrication support of decal, label, and placard products to our cargo and engineering teams through use of hand tools, printing, metal photo process, CNC cutting and Radio Frequency Identification (RFID) tags. | The position will also provide design support using Adobe Illustrator, Photoshop, NiceLabel and RFID software. | Enrolled in BS degree or Masters, in a relevant area of study and working towards a degree in Engineering, or related field at an accredited college/university.Create artwork for decals using Photoshop, Illustrator NiceLabel and Zebra Designer sof... | Show more\n          \n\n          \n\n\n\n        \n            Show less\n          \n\n          \n\n \n\n\n\n\n            Seniority level\n          \n\n            Internship\n          \n\n\n\n            Employment type\n          \n\n            Internship\n          ..."
  },
  {
    "job_title": "Product Design Graduate Intern (Summer 2025)",
    "company_name": "Sigma",
    "location": "San Francisco, CA",
    "time_posted": "1 week ago",
    "num_applicants": "168 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Design, Art/Creative, and Information Technology",
    "Industries": "Software Development",
    "skills_desired": "spark",
    "degree_qualifications": "graduate",
    "job_responsibilities": "Sigma offers a spreadsheet-like interface that enables all decision makers to securely analyze up to billions of rows of live data with the unlimited scale and speed of the cloud. | With Sigma, everyone can quickly answer their own questions to make and visualize accurate, data-driven decisions.We are looking for Graduate students who are passionate about cutting edge cloud computing projects. | As a Product Design Graduate Intern, you will be developing and honing your skills with a full product experience team of product and visual designers, user researchers and content writers. | Our team is ideally looking for students that have strong visual design skills.Come join us in redefining the way users access big data and get insights.What You Will Be DoingYou will work on the visual identity of Sigma and the connection between... | You'll own a project from concept to delivery during your internship and will collaborate real-time with our Engineers and your fellow Product DesignersYou’ll collaborate with our product management, user research, customer success, and support te..."
  },
  {
    "job_title": "Accounting Intern",
    "company_name": "Tenant Inc.",
    "location": "Newport Beach, CA",
    "time_posted": "2 weeks ago",
    "num_applicants": "43 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Full-time",
    "Job Function": "Accounting/Auditing, Analyst, and Finance",
    "Industries": "Software Development",
    "skills_desired": "excel",
    "degree_qualifications": NaN,
    "job_responsibilities": "We want YOU to be part of this incredible adventure.Join Us as an Accounting Intern (with Data Experience)!At Tenant Inc., we thrive on nine core principles that set us apart and keep us ahead of the curve:🔮 Embrace a Solution Mindset: We view cha... | You’ll get hands-on experience working with our finance and data teams to ensure accurate financial reporting, analyze trends, and contribute to strategic decisions.Key Responsibilities:Assist in Accounts receivables, accounts payables, revenue ma..."
  },
  {
    "job_title": "Risk Management Intern",
    "company_name": "McCarthy Building Companies, Inc.",
    "location": "St Louis, MO",
    "time_posted": "1 week ago",
    "num_applicants": "26 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Full-time",
    "Job Function": "Finance and Sales",
    "Industries": "Construction",
    "skills_desired": NaN,
    "degree_qualifications": "bachelor",
    "job_responsibilities": "With offices nationwide, we specialize in a wide range of project types that are as diverse and wide-ranging as the communities in which we build. | Our innovative teams collaborate with clients and industry partners throughout the project life cycle, starting in the earliest stages of design, throughout construction and beyond project completion.McCarthy’s reputation for tackling the toughest..."
  },
  {
    "job_title": "Creator Network Enablement Intern (TikTok LIVE - AMS) - 2025 Project Intern (BS/MS)",
    "company_name": "TikTok",
    "location": "Los Angeles, CA",
    "time_posted": "1 week ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Information Technology",
    "Industries": "Entertainment Providers",
    "skills_desired": "excel",
    "degree_qualifications": "undergraduate, graduate",
    "job_responsibilities": "By focusing on these areas, we aim to elevate the overall live experience for users, empower creators, and build strong, sustainable partnerships within the creator community.We are looking for talented individuals to join us for an internship in ... | Here, you will utilize your knowledge in real-world scenarios while laying a strong foundation for personal and professional growth.Candidates can apply to a maximum of two positions and will be considered for jobs in the order you apply. | Applications will be reviewed on a rolling basis - we encourage you to apply early.Responsibilities: Business Analysis: Conduct data analysis to understand the current trend Creator Network partners and identify the main focus. | Training materials development: based on the current focus, identify top players and gather best practices to create playbooks that can be shared with internal and external teams. | Creator Network Certification Program Support: Gather learnings from the pilot program and seek ways to improve the training materials and system."
  },
  {
    "job_title": "Intern Information Systems Department",
    "company_name": "Metropolitan Family Services",
    "location": "Chicago, IL",
    "time_posted": "4 days ago",
    "num_applicants": "46 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Part-time",
    "Job Function": "Information Technology",
    "Industries": "Non-profit Organizations",
    "skills_desired": "tableau",
    "degree_qualifications": "bachelor, master",
    "job_responsibilities": "Additionally, may be asked to support in staff trainings on Information Systems Application topics.Will learn and support the system operations team in fulfilling project tasks related to network and servers, equipment, E-Fax, Zoom, or other proje..."
  },
  {
    "job_title": "Business Development Intern - Reopened -",
    "company_name": "Dezu",
    "location": "Miami, FL",
    "time_posted": "11 hours ago",
    "num_applicants": "32 applicants",
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Business Development and Sales",
    "Industries": "Accounting",
    "skills_desired": NaN,
    "degree_qualifications": "bachelor",
    "job_responsibilities": "Generate leads and build a pipeline of prospective business opportunities.Outreach & Relationship Building: Assist in reaching out to potential partners, clients, or collaborators via email, social media, or other channels. | Help nurture relationships to support long-term partnerships.Competitive Analysis: Analyze competitors and market trends to provide insights that inform Dezu’s business strategy.Support Sales Efforts: Assist in creating proposals, pitch decks, and..."
  },
  {
    "job_title": "Intern - Construction Materials Testing (CMT)",
    "company_name": "GSI Engineering LLC",
    "location": "Panama City, FL",
    "time_posted": "2 weeks ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Management and Manufacturing",
    "Industries": "Environmental Services",
    "skills_desired": NaN,
    "degree_qualifications": NaN,
    "job_responsibilities": "This internship presents an excellent opportunity for students or recent graduates to gain hands-on experience, develop valuable skills, and make meaningful contributions to our organization.W hat You’ll GainExposure to real-world construction sit... | We know that the projects we deliver are only as good as our people, which is why we offer enriching opportunities for career growth at every level.Growing in ExcellenceAs the #1 fastest growing AEC firm on The Zweig Group's Hot Firm list in 2021,..."
  },
  {
    "job_title": "Intern - Construction Materials Testing (CMT)",
    "company_name": "GSI Engineering LLC",
    "location": "Pensacola, FL",
    "time_posted": "2 weeks ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Management and Manufacturing",
    "Industries": "Environmental Services",
    "skills_desired": NaN,
    "degree_qualifications": NaN,
    "job_responsibilities": "This internship presents an excellent opportunity for students or recent graduates to gain hands-on experience, develop valuable skills, and make meaningful contributions to our organization.W hat You’ll GainExposure to real-world construction sit... | We know that the projects we deliver are only as good as our people, which is why we offer enriching opportunities for career growth at every level.Growing in ExcellenceAs the #1 fastest growing AEC firm on The Zweig Group's Hot Firm list in 2021,..."
  },
  {
    "job_title": "Intern - Construction Materials Testing (CMT)",
    "company_name": "GSI Engineering LLC",
    "location": "Jacksonville, FL",
    "time_posted": "2 weeks ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Internship",
    "Job Function": "Management and Manufacturing",
    "Industries": "Environmental Services",
    "skills_desired": NaN,
    "degree_qualifications": NaN,
    "job_responsibilities": "This internship presents an excellent opportunity for students or recent graduates to gain hands-on experience, develop valuable skills, and make meaningful contributions to our organization.W hat You’ll GainExposure to real-world construction sit... | We know that the projects we deliver are only as good as our people, which is why we offer enriching opportunities for career growth at every level.Growing in ExcellenceAs the #1 fastest growing AEC firm on The Zweig Group's Hot Firm list in 2021,..."
  },
  {
    "job_title": "Intern - Business Enablement",
    "company_name": "Sharecare",
    "location": "United States",
    "time_posted": "2 weeks ago",
    "num_applicants": NaN,
    "Seniority Level": "Internship",
    "Employment Type": "Full-time",
    "Job Function": "Education and Training",
    "Industries": "Wellness and Fitness Services",
    "skills_desired": "excel, power bi",
    "degree_qualifications": "bachelor, undergraduate",
    "job_responsibilities": "To learn more, visit www.sharecare.com.Job Summary:The Business Enablement Intern will gain hands-on experience in sales enablement, market intelligence, and business operations in support of the Business Insights & Operations team at Sharecare. | This role provides an opportunity to develop analytical, research, and process improvement skills while supporting key initiatives across sales, account management, and client success stakeholders.Essential Functions: RFP & Content ManagementMaint... | Competitive Intelligence & Market ResearchConduct market research to gather industry reports & insights to support leadership team. | Collect, analyze and synthesize competitor and market intelligence relevant to health and wellbeing. | Assist with preparing insights and reports for sales and account management teams."
  }
]